/* automatically generated by rust-bindgen */

pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _ISOC95_SOURCE: u32 = 1;
pub const _ISOC99_SOURCE: u32 = 1;
pub const _ISOC11_SOURCE: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const _XOPEN_SOURCE: u32 = 700;
pub const _XOPEN_SOURCE_EXTENDED: u32 = 1;
pub const _LARGEFILE64_SOURCE: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_ISOCXX11: u32 = 1;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const __USE_XOPEN: u32 = 1;
pub const __USE_XOPEN_EXTENDED: u32 = 1;
pub const __USE_UNIX98: u32 = 1;
pub const _LARGEFILE_SOURCE: u32 = 1;
pub const __USE_XOPEN2K8XSI: u32 = 1;
pub const __USE_XOPEN2KXSI: u32 = 1;
pub const __USE_LARGEFILE: u32 = 1;
pub const __USE_LARGEFILE64: u32 = 1;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_GNU: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __STDC_NO_THREADS__: u32 = 1;

pub const DNNL_ARG_WEIGHTS_ITER: u32 = 34;
pub const DNNL_ARG_WEIGHTS_2: u32 = 35;
pub const DNNL_ARG_WEIGHTS_PEEPHOLE: u32 = 35;
pub const DNNL_ARG_WEIGHTS_3: u32 = 36;
pub const DNNL_ARG_WEIGHTS_PROJECTION: u32 = 36;
pub const DNNL_ARG_BIAS: u32 = 41;
pub const DNNL_ARG_MEAN: u32 = 49;
pub const DNNL_ARG_VARIANCE: u32 = 50;
pub const DNNL_ARG_WORKSPACE: u32 = 64;
pub const DNNL_ARG_SCRATCHPAD: u32 = 80;
pub const DNNL_ARG_DIFF_SRC_0: u32 = 129;
pub const DNNL_ARG_DIFF_SRC: u32 = 129;
pub const DNNL_ARG_DIFF_SRC_LAYER: u32 = 129;
pub const DNNL_ARG_DIFF_SRC_1: u32 = 130;
pub const DNNL_ARG_DIFF_SRC_ITER: u32 = 130;
pub const DNNL_ARG_DIFF_SRC_2: u32 = 131;
pub const DNNL_ARG_DIFF_SRC_ITER_C: u32 = 131;
pub const DNNL_ARG_DIFF_DST_0: u32 = 145;
pub const DNNL_ARG_DIFF_DST: u32 = 145;
pub const DNNL_ARG_DIFF_DST_LAYER: u32 = 145;
pub const DNNL_ARG_DIFF_DST_1: u32 = 146;
pub const DNNL_ARG_DIFF_DST_ITER: u32 = 146;
pub const DNNL_ARG_DIFF_DST_2: u32 = 147;
pub const DNNL_ARG_DIFF_DST_ITER_C: u32 = 147;
pub const DNNL_ARG_DIFF_WEIGHTS_0: u32 = 161;
pub const DNNL_ARG_DIFF_WEIGHTS: u32 = 161;
pub const DNNL_ARG_DIFF_SCALE_SHIFT: u32 = 161;
pub const DNNL_ARG_DIFF_WEIGHTS_LAYER: u32 = 161;
pub const DNNL_ARG_DIFF_WEIGHTS_1: u32 = 162;
pub const DNNL_ARG_DIFF_WEIGHTS_ITER: u32 = 162;
pub const DNNL_ARG_DIFF_WEIGHTS_2: u32 = 163;
pub const DNNL_ARG_DIFF_WEIGHTS_PEEPHOLE: u32 = 163;
pub const DNNL_ARG_DIFF_WEIGHTS_3: u32 = 164;
pub const DNNL_ARG_DIFF_WEIGHTS_PROJECTION: u32 = 164;
pub const DNNL_ARG_DIFF_BIAS: u32 = 169;
pub const DNNL_ARG_ATTR_OUTPUT_SCALES: u32 = 513;
pub const DNNL_ARG_MULTIPLE_SRC: u32 = 1024;
pub const DNNL_ARG_MULTIPLE_DST: u32 = 2048;
pub const DNNL_ARG_ATTR_ZERO_POINTS: u32 = 4096;
pub const DNNL_ARG_ATTR_POST_OP_DW: u32 = 8192;
pub const DNNL_RUNTIME_NONE: u32 = 0;
pub const DNNL_RUNTIME_SEQ: u32 = 1;
pub const DNNL_RUNTIME_OMP: u32 = 2;
pub const DNNL_RUNTIME_TBB: u32 = 4;
pub const DNNL_RUNTIME_THREADPOOL: u32 = 8;
pub const DNNL_RUNTIME_OCL: u32 = 256;
pub const DNNL_JIT_PROFILE_NONE: u32 = 0;
pub const DNNL_JIT_PROFILE_VTUNE: u32 = 1;
pub const DNNL_JIT_PROFILE_LINUX_PERFMAP: u32 = 2;
pub const DNNL_JIT_PROFILE_LINUX_JITDUMP: u32 = 4;
pub const DNNL_JIT_PROFILE_LINUX_JITDUMP_USE_TSC: u32 = 8;
pub const DNNL_JIT_PROFILE_LINUX_PERF: u32 = 6;
pub const DNNL_CPU_THREADING_RUNTIME: u32 = 2;
pub const DNNL_CPU_RUNTIME: u32 = 2;
pub const DNNL_GPU_RUNTIME: u32 = 0;
pub const DNNL_VERSION_MAJOR: u32 = 1;
pub const DNNL_VERSION_MINOR: u32 = 5;
pub const DNNL_VERSION_PATCH: u32 = 0;
pub const DNNL_VERSION_HASH: &'static [u8; 41usize] = b"f5997b5e6726de82d19ae9b86b08d80aea4af82e\0";
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::libc::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub type __u_char = ::libc::c_uchar;
pub type __u_short = ::libc::c_ushort;
pub type __u_int = ::libc::c_uint;
pub type __u_long = ::libc::c_ulong;
pub type __int8_t = ::libc::c_schar;
pub type __uint8_t = ::libc::c_uchar;
pub type __int16_t = ::libc::c_short;
pub type __uint16_t = ::libc::c_ushort;
pub type __int32_t = ::libc::c_int;
pub type __uint32_t = ::libc::c_uint;
pub type __int64_t = ::libc::c_long;
pub type __uint64_t = ::libc::c_ulong;
pub type __quad_t = ::libc::c_long;
pub type __u_quad_t = ::libc::c_ulong;
pub type __intmax_t = ::libc::c_long;
pub type __uintmax_t = ::libc::c_ulong;
pub type __dev_t = ::libc::c_ulong;
pub type __uid_t = ::libc::c_uint;
pub type __gid_t = ::libc::c_uint;
pub type __ino_t = ::libc::c_ulong;
pub type __ino64_t = ::libc::c_ulong;
pub type __mode_t = ::libc::c_uint;
pub type __nlink_t = ::libc::c_ulong;
pub type __off_t = ::libc::c_long;
pub type __off64_t = ::libc::c_long;
pub type __pid_t = ::libc::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::libc::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::libc::c_long;
pub type __rlim_t = ::libc::c_ulong;
pub type __rlim64_t = ::libc::c_ulong;
pub type __id_t = ::libc::c_uint;
pub type __time_t = ::libc::c_long;
pub type __useconds_t = ::libc::c_uint;
pub type __suseconds_t = ::libc::c_long;
pub type __daddr_t = ::libc::c_int;
pub type __key_t = ::libc::c_int;
pub type __clockid_t = ::libc::c_int;
pub type __timer_t = *mut ::libc::c_void;
pub type __blksize_t = ::libc::c_long;
pub type __blkcnt_t = ::libc::c_long;
pub type __blkcnt64_t = ::libc::c_long;
pub type __fsblkcnt_t = ::libc::c_ulong;
pub type __fsblkcnt64_t = ::libc::c_ulong;
pub type __fsfilcnt_t = ::libc::c_ulong;
pub type __fsfilcnt64_t = ::libc::c_ulong;
pub type __fsword_t = ::libc::c_long;
pub type __ssize_t = ::libc::c_long;
pub type __syscall_slong_t = ::libc::c_long;
pub type __syscall_ulong_t = ::libc::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::libc::c_char;
pub type __intptr_t = ::libc::c_long;
pub type __socklen_t = ::libc::c_uint;
pub type __sig_atomic_t = ::libc::c_int;
pub type int_least8_t = ::libc::c_schar;
pub type int_least16_t = ::libc::c_short;
pub type int_least32_t = ::libc::c_int;
pub type int_least64_t = ::libc::c_long;
pub type uint_least8_t = ::libc::c_uchar;
pub type uint_least16_t = ::libc::c_ushort;
pub type uint_least32_t = ::libc::c_uint;
pub type uint_least64_t = ::libc::c_ulong;
pub type int_fast8_t = ::libc::c_schar;
pub type int_fast16_t = ::libc::c_long;
pub type int_fast32_t = ::libc::c_long;
pub type int_fast64_t = ::libc::c_long;
pub type uint_fast8_t = ::libc::c_uchar;
pub type uint_fast16_t = ::libc::c_ulong;
pub type uint_fast32_t = ::libc::c_ulong;
pub type uint_fast64_t = ::libc::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
#[repr(u32)]
#[non_exhaustive]
#[doc = " Status values returned by the library functions."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum dnnl_status_t {
    #[doc = " The operation was successful"]
    dnnl_success = 0,
    #[doc = " The operation failed due to an out-of-memory condition"]
    dnnl_out_of_memory = 1,
    #[doc = " The operation failed because of incorrect function arguments"]
    dnnl_invalid_arguments = 2,
    #[doc = " The operation failed because requested functionality is not implemented"]
    dnnl_unimplemented = 3,
    #[doc = " Primitive iterator passed over last primitive descriptor"]
    dnnl_iterator_ends = 4,
    #[doc = " Primitive or engine failed on execution"]
    dnnl_runtime_error = 5,
    #[doc = " Queried element is not required for given primitive"]
    dnnl_not_required = 6,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = " Data type specification"]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum dnnl_data_type_t {
    #[doc = " Undefined data type, used for empty memory descriptors."]
    dnnl_data_type_undef = 0,
    #[doc = " 16-bit/half-precision floating point."]
    dnnl_f16 = 1,
    #[doc = " non-standard 16-bit (bfloat16 w/ 7 bit mantissa) floating point."]
    dnnl_bf16 = 2,
    #[doc = " 32-bit/single-precision floating point."]
    dnnl_f32 = 3,
    #[doc = " 32-bit signed integer."]
    dnnl_s32 = 4,
    #[doc = " 8-bit signed integer."]
    dnnl_s8 = 5,
    #[doc = " 8-bit unsigned integer."]
    dnnl_u8 = 6,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = " Memory format kind"]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum dnnl_format_kind_t {
    #[doc = " Undefined memory format kind, used for empty memory descriptors."]
    dnnl_format_kind_undef = 0,
    #[doc = " Unspecified format kind."]
    #[doc = " The primitive selects a format automatically."]
    dnnl_format_kind_any = 1,
    #[doc = " A tensor in a generic format described by the stride and blocking"]
    #[doc = " values in each dimension. See @ref dnnl_blocking_desc_t for more"]
    #[doc = " information."]
    dnnl_blocked = 2,
    #[doc = " Weights format used in 8bit Winograd convolution"]
    dnnl_format_kind_wino = 3,
    #[doc = " Packed weights format used in RNN"]
    dnnl_format_kind_rnn_packed = 4,
}
impl dnnl_format_tag_t {
    pub const dnnl_x: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_a;
}
impl dnnl_format_tag_t {
    pub const dnnl_nc: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ab;
}
impl dnnl_format_tag_t {
    pub const dnnl_cn: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ba;
}
impl dnnl_format_tag_t {
    pub const dnnl_tn: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ab;
}
impl dnnl_format_tag_t {
    pub const dnnl_nt: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ba;
}
impl dnnl_format_tag_t {
    pub const dnnl_ncw: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_abc;
}
impl dnnl_format_tag_t {
    pub const dnnl_nwc: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_acb;
}
impl dnnl_format_tag_t {
    pub const dnnl_nchw: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_abcd;
}
impl dnnl_format_tag_t {
    pub const dnnl_nhwc: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_acdb;
}
impl dnnl_format_tag_t {
    pub const dnnl_chwn: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_bcda;
}
impl dnnl_format_tag_t {
    pub const dnnl_ncdhw: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_abcde;
}
impl dnnl_format_tag_t {
    pub const dnnl_ndhwc: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_acdeb;
}
impl dnnl_format_tag_t {
    pub const dnnl_oi: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ab;
}
impl dnnl_format_tag_t {
    pub const dnnl_io: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ba;
}
impl dnnl_format_tag_t {
    pub const dnnl_oiw: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_abc;
}
impl dnnl_format_tag_t {
    pub const dnnl_owi: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_acb;
}
impl dnnl_format_tag_t {
    pub const dnnl_wio: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_cba;
}
impl dnnl_format_tag_t {
    pub const dnnl_iwo: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_bca;
}
impl dnnl_format_tag_t {
    pub const dnnl_oihw: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_abcd;
}
impl dnnl_format_tag_t {
    pub const dnnl_hwio: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_cdba;
}
impl dnnl_format_tag_t {
    pub const dnnl_ohwi: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_acdb;
}
impl dnnl_format_tag_t {
    pub const dnnl_ihwo: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_bcda;
}
impl dnnl_format_tag_t {
    pub const dnnl_iohw: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_bacd;
}
impl dnnl_format_tag_t {
    pub const dnnl_oidhw: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_abcde;
}
impl dnnl_format_tag_t {
    pub const dnnl_iodhw: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_bacde;
}
impl dnnl_format_tag_t {
    pub const dnnl_dhwio: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_cdeba;
}
impl dnnl_format_tag_t {
    pub const dnnl_odhwi: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_acdeb;
}
impl dnnl_format_tag_t {
    pub const dnnl_idhwo: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_bcdea;
}
impl dnnl_format_tag_t {
    pub const dnnl_goiw: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_abcd;
}
impl dnnl_format_tag_t {
    pub const dnnl_wigo: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_dcab;
}
impl dnnl_format_tag_t {
    pub const dnnl_goihw: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_abcde;
}
impl dnnl_format_tag_t {
    pub const dnnl_hwigo: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_decab;
}
impl dnnl_format_tag_t {
    pub const dnnl_giohw: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_acbde;
}
impl dnnl_format_tag_t {
    pub const dnnl_goidhw: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_abcdef;
}
impl dnnl_format_tag_t {
    pub const dnnl_giodhw: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_acbdef;
}
impl dnnl_format_tag_t {
    pub const dnnl_dhwigo: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_defcab;
}
impl dnnl_format_tag_t {
    pub const dnnl_tnc: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_abc;
}
impl dnnl_format_tag_t {
    pub const dnnl_ntc: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_bac;
}
impl dnnl_format_tag_t {
    pub const dnnl_ldnc: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_abcd;
}
impl dnnl_format_tag_t {
    pub const dnnl_ldigo: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_abcde;
}
impl dnnl_format_tag_t {
    pub const dnnl_ldgoi: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_abdec;
}
impl dnnl_format_tag_t {
    pub const dnnl_ldio: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_abcd;
}
impl dnnl_format_tag_t {
    pub const dnnl_ldoi: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_abdc;
}
impl dnnl_format_tag_t {
    pub const dnnl_ldgo: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_abcd;
}
impl dnnl_format_tag_t {
    pub const dnnl_nCdhw32c: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBcde32b;
}
impl dnnl_format_tag_t {
    pub const dnnl_nCdhw16c: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBcde16b;
}
impl dnnl_format_tag_t {
    pub const dnnl_nCdhw4c: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBcde4b;
}
impl dnnl_format_tag_t {
    pub const dnnl_nCdhw8c: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBcde8b;
}
impl dnnl_format_tag_t {
    pub const dnnl_nChw32c: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBcd32b;
}
impl dnnl_format_tag_t {
    pub const dnnl_nChw16c: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBcd16b;
}
impl dnnl_format_tag_t {
    pub const dnnl_nChw4c: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBcd4b;
}
impl dnnl_format_tag_t {
    pub const dnnl_nChw8c: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBcd8b;
}
impl dnnl_format_tag_t {
    pub const dnnl_nCw32c: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBc32b;
}
impl dnnl_format_tag_t {
    pub const dnnl_nCw16c: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBc16b;
}
impl dnnl_format_tag_t {
    pub const dnnl_nCw4c: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBc4b;
}
impl dnnl_format_tag_t {
    pub const dnnl_nCw8c: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBc8b;
}
impl dnnl_format_tag_t {
    pub const dnnl_NCw16n16c: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABc16a16b;
}
impl dnnl_format_tag_t {
    pub const dnnl_NCdhw16n16c: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABcde16a16b;
}
impl dnnl_format_tag_t {
    pub const dnnl_NChw16n16c: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABcd16a16b;
}
impl dnnl_format_tag_t {
    pub const dnnl_NCw32n32c: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABc32a32b;
}
impl dnnl_format_tag_t {
    pub const dnnl_NChw32n32c: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABcd32a32b;
}
impl dnnl_format_tag_t {
    pub const dnnl_NCdhw32n32c: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABcde32a32b;
}
impl dnnl_format_tag_t {
    pub const dnnl_IOw16o16i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_BAc16a16b;
}
impl dnnl_format_tag_t {
    pub const dnnl_IOw16i16o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_BAc16b16a;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIw16i16o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABc16b16a;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIw16o16i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABc16a16b;
}
impl dnnl_format_tag_t {
    pub const dnnl_Oiw16o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_Abc16a;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIw4i16o4i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABc4b16a4b;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIw2i8o4i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABc2b8a4b;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIw4i4o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABc4b4a;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIw4o4i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABc4a4b;
}
impl dnnl_format_tag_t {
    pub const dnnl_Oiw4o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_Abc4a;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIw8i16o2i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABc8b16a2b;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIw8i8o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABc8b8a;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIw8o16i2o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABc8a16b2a;
}
impl dnnl_format_tag_t {
    pub const dnnl_IOw8o16i2o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_BAc8a16b2a;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIw8o8i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABc8a8b;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIw8o4i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABc8a4b;
}
impl dnnl_format_tag_t {
    pub const dnnl_Owi16o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_Acb16a;
}
impl dnnl_format_tag_t {
    pub const dnnl_OwI16o2i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_AcB16a2b;
}
impl dnnl_format_tag_t {
    pub const dnnl_Owi4o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_Acb4a;
}
impl dnnl_format_tag_t {
    pub const dnnl_Owi8o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_Acb8a;
}
impl dnnl_format_tag_t {
    pub const dnnl_IOhw16i16o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_BAcd16b16a;
}
impl dnnl_format_tag_t {
    pub const dnnl_IOhw16o16i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_BAcd16a16b;
}
impl dnnl_format_tag_t {
    pub const dnnl_Ohwi16o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_Acdb16a;
}
impl dnnl_format_tag_t {
    pub const dnnl_OhwI16o2i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_AcdB16a2b;
}
impl dnnl_format_tag_t {
    pub const dnnl_Ohwi32o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_Acdb32a;
}
impl dnnl_format_tag_t {
    pub const dnnl_Ohwi4o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_Acdb4a;
}
impl dnnl_format_tag_t {
    pub const dnnl_Ohwi8o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_Acdb8a;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIhw16i16o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABcd16b16a;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIhw16o16i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABcd16a16b;
}
impl dnnl_format_tag_t {
    pub const dnnl_Oihw16o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_Abcd16a;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIhw4i16o4i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABcd4b16a4b;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIhw4i4o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABcd4b4a;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIhw4o4i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABcd4a4b;
}
impl dnnl_format_tag_t {
    pub const dnnl_Oihw4o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_Abcd4a;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIhw8i16o2i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABcd8b16a2b;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIhw8i8o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABcd8b8a;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIhw8o16i2o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABcd8a16b2a;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIhw2i8o4i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABcd2b8a4b;
}
impl dnnl_format_tag_t {
    pub const dnnl_IOhw8o16i2o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_BAcd8a16b2a;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIhw8o8i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABcd8a8b;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIhw8o4i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABcd8a4b;
}
impl dnnl_format_tag_t {
    pub const dnnl_Odhwi16o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_Acdeb16a;
}
impl dnnl_format_tag_t {
    pub const dnnl_OdhwI16o2i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_AcdeB16a2b;
}
impl dnnl_format_tag_t {
    pub const dnnl_Odhwi4o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_Acdeb4a;
}
impl dnnl_format_tag_t {
    pub const dnnl_Odhwi8o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_Acdeb8a;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIdhw16i16o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABcde16b16a;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIdhw16o16i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABcde16a16b;
}
impl dnnl_format_tag_t {
    pub const dnnl_Oidhw16o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_Abcde16a;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIdhw4i4o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABcde4b4a;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIdhw4o4i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABcde4a4b;
}
impl dnnl_format_tag_t {
    pub const dnnl_Oidhw4o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_Abcde4a;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIdhw8i16o2i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABcde8b16a2b;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIdhw8i8o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABcde8b8a;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIdhw8o16i2o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABcde8a16b2a;
}
impl dnnl_format_tag_t {
    pub const dnnl_IOdhw8o16i2o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_BAcde8a16b2a;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIdhw4i16o4i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABcde4b16a4b;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIdhw2i8o4i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABcde2b8a4b;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIdhw8o8i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABcde8a8b;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIdhw8o4i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABcde8a4b;
}
impl dnnl_format_tag_t {
    pub const dnnl_IOdhw16i16o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_BAcde16b16a;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIdhw4o8i8o4i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABcde4a8b8a4b;
}
impl dnnl_format_tag_t {
    pub const dnnl_IOdhw16o16i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_BAcde16a16b;
}
impl dnnl_format_tag_t {
    pub const dnnl_Goiw16g: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_Abcd16a;
}
impl dnnl_format_tag_t {
    pub const dnnl_Goiw8g: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_Abcd8a;
}
impl dnnl_format_tag_t {
    pub const dnnl_gIOw16o16i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aCBd16b16c;
}
impl dnnl_format_tag_t {
    pub const dnnl_gIOw16i16o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aCBd16c16b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIw16i16o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCd16c16b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIw16o16i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCd16b16c;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOiw16o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBcd16b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIw4i16o4i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCd4c16b4c;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIw2i8o4i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCd2c8b4c;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIw4i4o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCd4c4b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIw4o4i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCd4b4c;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOiw4o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBcd4b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIw8i16o2i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCd8c16b2c;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIw8i8o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCd8c8b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIw8o16i2o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCd8b16c2b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gIOw8o16i2o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aCBd8b16c2b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIw8o8i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCd8b8c;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIw8o4i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCd8b4c;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOwi16o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBdc16b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOwI16o2i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBdC16b2c;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOwi4o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBdc4b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOwi8o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBdc8b;
}
impl dnnl_format_tag_t {
    pub const dnnl_Goiw32g: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_Abcd32a;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIw2i4o2i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCd2c4b2c;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIw2o4i2o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCd2b4c2b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIw4i8o2i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCd4c8b2c;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIw4o8i2o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCd4b8c2b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gIOhw16i16o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aCBde16c16b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gIOhw16o16i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aCBde16b16c;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOhwi16o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBdec16b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOhwI16o2i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBdeC16b2c;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOhwi32o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBdec32b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOhwi4o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBdec4b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOhwi8o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBdec8b;
}
impl dnnl_format_tag_t {
    pub const dnnl_Goihw16g: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_Abcde16a;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIhw16i16o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCde16c16b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIhw16o16i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCde16b16c;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOihw16o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBcde16b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIhw2i8o4i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCde2c8b4c;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIhw4i16o4i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCde4c16b4c;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIhw4i4o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCde4c4b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIhw4o4i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCde4b4c;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOihw4o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBcde4b;
}
impl dnnl_format_tag_t {
    pub const dnnl_Goihw8g: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_Abcde8a;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIhw8i16o2i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCde8c16b2c;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIhw8i8o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCde8c8b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIhw8o16i2o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCde8b16c2b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gIOhw8o16i2o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aCBde8b16c2b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIhw8o8i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCde8b8c;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIhw8o4i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCde8b4c;
}
impl dnnl_format_tag_t {
    pub const dnnl_Goihw32g: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_Abcde32a;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIw4o8i8o4i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABc4a8b8a4b;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIhw4o8i8o4i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABcd4a8b8a4b;
}
impl dnnl_format_tag_t {
    pub const dnnl_IOw4i8o8i4o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_BAc4b8a8b4a;
}
impl dnnl_format_tag_t {
    pub const dnnl_IOhw4i8o8i4o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_BAcd4b8a8b4a;
}
impl dnnl_format_tag_t {
    pub const dnnl_IOdhw4i8o8i4o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_BAcde4b8a8b4a;
}
impl dnnl_format_tag_t {
    pub const dnnl_OIhw2o8i8o2i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_ABcd2a8b8a2b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIw4o8i8o4i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCd4b8c8b4c;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIhw4o8i8o4i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCde4b8c8b4c;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIdhw4o8i8o4i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCdef4b8c8b4c;
}
impl dnnl_format_tag_t {
    pub const dnnl_gIOw4i8o8i4o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aCBd4c8b8c4b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gIOhw4i8o8i4o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aCBde4c8b8c4b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gIOdhw4i8o8i4o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aCBdef4c8b8c4b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIhw2o8i8o2i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCde2b8c8b2c;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIhw2i4o2i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCde2c4b2c;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIhw2o4i2o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCde2b4c2b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIhw4i8o2i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCde4c8b2c;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIhw4o8i2o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCde4b8c2b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gIOdhw16i16o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aCBdef16c16b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gIOdhw16o16i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aCBdef16b16c;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOdhwi16o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBdefc16b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOdhwI16o2i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBdefC16b2c;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOdhwi4o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBdefc4b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOdhwi8o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBdefc8b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIdhw16i16o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCdef16c16b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIdhw4i16o4i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCdef4c16b4c;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIdhw2i8o4i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCdef2c8b4c;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIdhw16o16i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCdef16b16c;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOidhw16o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBcdef16b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIdhw4i4o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCdef4c4b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIdhw4o4i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCdef4b4c;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOidhw4o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBcdef4b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIdhw8i16o2i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCdef8c16b2c;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIdhw8i8o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCdef8c8b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIdhw8o16i2o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCdef8b16c2b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gIOdhw8o16i2o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aCBdef8b16c2b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIdhw8o8i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCdef8b8c;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIdhw8o4i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCdef8b4c;
}
impl dnnl_format_tag_t {
    pub const dnnl_Goidhw16g: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_Abcdef16a;
}
impl dnnl_format_tag_t {
    pub const dnnl_Goidhw32g: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_Abcdef32a;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIdhw2i4o2i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCdef2c4b2c;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIdhw4i8o2i: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCdef4c8b2c;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIdhw2o4i2o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCdef2b4c2b;
}
impl dnnl_format_tag_t {
    pub const dnnl_gOIdhw4o8i2o: dnnl_format_tag_t = dnnl_format_tag_t::dnnl_aBCdef4b8c2b;
}
#[repr(u32)]
#[non_exhaustive]
#[doc = " Memory format tag specification."]
#[doc = ""]
#[doc = " oneDNN formats describe physical data layout. The physical layout"]
#[doc = " is described as a sequence of the dimensions as they are laid out in the"]
#[doc = " memory (from the outer-most to the inner-most). Note that this order"]
#[doc = " doesn't affect the logical order of the dimensions that is kept in the"]
#[doc = " `dims` field of the dnnl_memory_desc_t structure. The logical order of the"]
#[doc = " dimensions is specified by the primitive that uses the tensor."]
#[doc = ""]
#[doc = " For example, CNN 5D tensor always has its logical dimensions in the order"]
#[doc = " `(batch, channels, depth, height, width)`, while the physical layout might be"]
#[doc = " `NCDHW` (corresponds to #dnnl_ncdhw format tag) or"]
#[doc = " `NDHWC` (corresponds to #dnnl_ndhwc format tag)."]
#[doc = ""]
#[doc = " ~~~cpp"]
#[doc = " int batch = 2, channels = 16, depth = 13, height = 13, width = 13;"]
#[doc = ""]
#[doc = " int ndims = 5; // 5D tensor"]
#[doc = " dnnl_dims_t dims = {batch, channels, depth, height, width};"]
#[doc = " dnnl_memory_desc_t data_in_ncdhw;"]
#[doc = " dnnl_memory_desc_init_by_tag("]
#[doc = "      &data_in_ncdhw, 5, dims, dnnl_f32, dnnl_ncdhw);"]
#[doc = ""]
#[doc = " // note that in both cases dims passed are the same"]
#[doc = " dnnl_memory_desc_t data_in_ndhwc;"]
#[doc = " dnnl_memory_desc_init_by_tag("]
#[doc = "      &data_in_ndhwc, 5, dims, dnnl_f32, dnnl_ndhwc);"]
#[doc = " ~~~"]
#[doc = ""]
#[doc = " Memory format tags can be further divided into two categories:"]
#[doc = "  - Domain-agnostic names, i.e. names the do not depend on the tensor usage"]
#[doc = "    in the specific primitive. These names use letters from `a` to `l` to"]
#[doc = "    denote logical dimension from 1 to 12, and form the order in which the"]
#[doc = "    dimensions are laid in memory. For instance, #dnnl_ab is used to denote"]
#[doc = "    2D tensor where the second logical dimension (aka `b`) is the innermost,"]
#[doc = "    i.e. has stride = 1, and the first logical dimension (`a`) laid out in"]
#[doc = "    memory with stride equal to the size of second dimension. On the other"]
#[doc = "    hand, #dnnl_ba is just transposed version of the same tensor: the"]
#[doc = "    first dimension (`a`) becomes the innermost one."]
#[doc = "  - Domain-specific names, i.e. names that make sense only in the context of"]
#[doc = "    a certain domain, such as CNN. This names are just aliases to the"]
#[doc = "    corresponding domain-agnostic tags and used mostly for the convenience."]
#[doc = "    For example, #dnnl_nc is used to denote 2D CNN activations tensor"]
#[doc = "    memory format, where channels are the innermost dimension and batch is an"]
#[doc = "    outermost one. Moreover, #dnnl_nc is just an alias to #dnnl_ab,"]
#[doc = "    since for oneDNN CNN primitives the logical dimensions of"]
#[doc = "    activations tensors come in order: batch, channels, spatial."]
#[doc = "    In other words, batch corresponds to the first logical dimension (`a`),"]
#[doc = "    channels correspond to the second one (`b`)."]
#[doc = ""]
#[doc = " The following domain-specific notation applies to memory format tags:"]
#[doc = "  - @c 'n' denotes the mini-batch dimension"]
#[doc = "  - @c 'c' denotes a channels dimension"]
#[doc = "  - When there are multiple channel dimensions (for example, in convolution"]
#[doc = "    weights tensor), @c 'i' and @c 'o' denote dimensions of input and output"]
#[doc = "    channels"]
#[doc = "  - @c 'd', @c 'h', and @c 'w' denote spatial depth, height, and width"]
#[doc = "    respectively"]
#[doc = ""]
#[doc = " Upper-case letters indicate that the data is laid out in blocks for a"]
#[doc = " particular dimension. In such cases, the format name contains both upper-"]
#[doc = " and lower-case letters for that dimension with a lower-case letter preceded"]
#[doc = " by the block size. For example: #dnnl_nChw8c describes a format where the"]
#[doc = " outermost dimension is mini-batch, followed by the channel block number,"]
#[doc = " followed by the spatial height and width, and finally followed by 8-element"]
#[doc = " channel blocks."]
#[doc = ""]
#[doc = " @sa @ref dev_guide_understanding_memory_formats"]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum dnnl_format_tag_t {
    #[doc = " Undefined memory format tag"]
    dnnl_format_tag_undef = 0,
    #[doc = " Undefined memory format tag."]
    #[doc = " The primitive selects a format automatically."]
    dnnl_format_tag_any = 1,
    #[doc = "< plain 1D tensor"]
    dnnl_a = 2,
    #[doc = "< plain 2D tensor"]
    dnnl_ab = 3,
    #[doc = "< plain 3D tensor"]
    dnnl_abc = 4,
    #[doc = "< plain 4D tensor"]
    dnnl_abcd = 5,
    #[doc = "< plain 5D tensor"]
    dnnl_abcde = 6,
    #[doc = "< plain 6D tensor"]
    dnnl_abcdef = 7,
    #[doc = "< permuted 4D tensor"]
    dnnl_abdc = 8,
    #[doc = "< permuted 5D tensor"]
    dnnl_abdec = 9,
    #[doc = "< permuted 3D tensor"]
    dnnl_acb = 10,
    #[doc = "< permuted 5D tensor"]
    dnnl_acbde = 11,
    #[doc = "< permuted 6D tensor"]
    dnnl_acbdef = 12,
    #[doc = "< permuted 4D tensor"]
    dnnl_acdb = 13,
    #[doc = "< permuted 5D tensor"]
    dnnl_acdeb = 14,
    #[doc = "< permuted 2D tensor"]
    dnnl_ba = 15,
    #[doc = "< permuted 3D tensor"]
    dnnl_bac = 16,
    #[doc = "< permuted 4D tensor"]
    dnnl_bacd = 17,
    #[doc = "< permuted 5D tensor"]
    dnnl_bacde = 18,
    #[doc = "< permuted 3D tensor"]
    dnnl_bca = 19,
    #[doc = "< permuted 4D tensor"]
    dnnl_bcda = 20,
    #[doc = "< permuted 5D tensor"]
    dnnl_bcdea = 21,
    #[doc = "< permuted 3D tensor"]
    dnnl_cba = 22,
    #[doc = "< permuted 4D tensor"]
    dnnl_cdba = 23,
    #[doc = "< permuted 4D tensor"]
    dnnl_dcab = 24,
    #[doc = "< permuted 5D tensor"]
    dnnl_cdeba = 25,
    #[doc = "< permuted 5D tensor"]
    dnnl_decab = 26,
    #[doc = "< permuted 6D tensor"]
    dnnl_defcab = 27,
    dnnl_Abc16a = 28,
    dnnl_ABc16a16b = 29,
    dnnl_ABc32a32b = 30,
    dnnl_ABc4a4b = 31,
    #[doc = " 3D tensor blocked by 2nd dimension with block size 16"]
    dnnl_aBc16b = 32,
    #[doc = " 3D tensor blocked by 2nd dimension with block size 16"]
    dnnl_ABc16b16a = 33,
    #[doc = " 3D tensor blocked by 2nd dimension with block size 16"]
    dnnl_Abc4a = 34,
    #[doc = " 3D tensor blocked by 2nd dimension with block size 32"]
    dnnl_aBc32b = 35,
    #[doc = " 3D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBc4b = 36,
    #[doc = " 3D tensor blocked by 2nd dimension with block size 4"]
    dnnl_ABc4b16a4b = 37,
    #[doc = " 3D tensor blocked by 2nd dimension with block size 4"]
    dnnl_ABc2b8a4b = 38,
    #[doc = " 3D tensor blocked by 2nd dimension with block size 4"]
    dnnl_ABc4b4a = 39,
    #[doc = " 3D tensor blocked by 2nd dimension with block size 4"]
    dnnl_ABc8a16b2a = 40,
    #[doc = " 3D tensor blocked by 2nd dimension with block size 4"]
    dnnl_ABc8a8b = 41,
    #[doc = " 3D tensor blocked by 2nd dimension with block size 4"]
    dnnl_ABc8a4b = 42,
    #[doc = " 3D tensor blocked by 2nd dimension with block size 8"]
    dnnl_aBc8b = 43,
    #[doc = " 3D tensor blocked by 2nd dimension with block size 8"]
    dnnl_ABc8b16a2b = 44,
    #[doc = " 3D tensor blocked by 2nd dimension with block size 8"]
    dnnl_BAc8a16b2a = 45,
    #[doc = " 3D tensor blocked by 2nd dimension with block size 8"]
    dnnl_ABc8b8a = 46,
    #[doc = " 3D tensor blocked by 2nd dimension with block size 8"]
    dnnl_Abcd16a = 47,
    #[doc = " 3D tensor blocked by 2nd dimension with block size 8"]
    dnnl_Abcd8a = 48,
    #[doc = " 3D tensor blocked by 2nd dimension with block size 8"]
    dnnl_ABcd16a16b = 49,
    #[doc = " 3D tensor blocked by 2nd dimension with block size 8"]
    dnnl_Abcd32a = 50,
    #[doc = " 3D tensor blocked by 2nd dimension with block size 8"]
    dnnl_ABcd32a32b = 51,
    #[doc = " 4D tensor blocked by 2nd dimension with block size 16"]
    dnnl_aBcd16b = 52,
    #[doc = " 4D tensor blocked by 2nd dimension with block size 16"]
    dnnl_ABcd16b16a = 53,
    #[doc = " 4D tensor blocked by 2nd dimension with block size 16"]
    dnnl_aBCd16b16c = 54,
    #[doc = " 4D tensor blocked by 2nd dimension with block size 16"]
    dnnl_aBCd16c16b = 55,
    #[doc = " 4D tensor blocked by 2nd dimension with block size 16"]
    dnnl_Abcd4a = 56,
    #[doc = " 4D tensor blocked by 2nd dimension with block size 32"]
    dnnl_aBcd32b = 57,
    #[doc = " 4D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBcd4b = 58,
    #[doc = " 4D tensor blocked by 2nd dimension with block size 4"]
    dnnl_ABcd4b16a4b = 59,
    #[doc = " 4D tensor blocked by 2nd dimension with block size 4"]
    dnnl_ABcd4b4a = 60,
    #[doc = " 4D tensor blocked by 2nd dimension with block size 4"]
    dnnl_ABcd4a4b = 61,
    #[doc = " 4D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBCd2c4b2c = 62,
    #[doc = " 4D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBCd4b8c2b = 63,
    #[doc = " 4D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBCd4c16b4c = 64,
    #[doc = " 4D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBCd2c8b4c = 65,
    #[doc = " 4D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBCd4c4b = 66,
    #[doc = " 4D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBCd4b4c = 67,
    #[doc = " 4D tensor blocked by 2nd dimension with block size 4"]
    dnnl_ABcd8a16b2a = 68,
    #[doc = " 4D tensor blocked by 2nd dimension with block size 4"]
    dnnl_ABcd2b8a4b = 69,
    #[doc = " 4D tensor blocked by 2nd dimension with block size 4"]
    dnnl_ABcd8a8b = 70,
    #[doc = " 4D tensor blocked by 2nd dimension with block size 4"]
    dnnl_ABcd8a4b = 71,
    #[doc = " 4D tensor blocked by 2nd dimension with block size 8"]
    dnnl_aBcd8b = 72,
    #[doc = " 4D tensor blocked by 2nd dimension with block size 8"]
    dnnl_aBCd4c8b2c = 73,
    #[doc = " 4D tensor blocked by 2nd dimension with block size 8"]
    dnnl_ABcd8b16a2b = 74,
    #[doc = " 4D tensor blocked by 2nd dimension with block size 8"]
    dnnl_aBCd8b16c2b = 75,
    #[doc = " 4D tensor blocked by 2nd dimension with block size 8"]
    dnnl_BAcd8a16b2a = 76,
    #[doc = " 4D tensor blocked by 1st and 2nd dimension with block size 8"]
    dnnl_ABcd8b8a = 77,
    #[doc = " 4D tensor blocked by 1st and 2nd dimension with block size 8"]
    dnnl_aBCd8b8c = 78,
    #[doc = " 4D tensor blocked by 1st and 2nd dimension with block size 8"]
    dnnl_aBCd8b4c = 79,
    #[doc = " 4D tensor blocked by 1st and 2nd dimension with block size 8"]
    dnnl_aBCd8c16b2c = 80,
    #[doc = " 4D tensor blocked by 1st and 2nd dimension with block size 8"]
    dnnl_ABcde8a16b2a = 81,
    #[doc = " 4D tensor blocked by 1st and 2nd dimension with block size 8"]
    dnnl_aCBd8b16c2b = 82,
    #[doc = " 4D tensor blocked by 1st and 2nd dimension with block size 8"]
    dnnl_aBCd8c8b = 83,
    #[doc = " 4D tensor blocked by 1st and 2nd dimension with block size 8"]
    dnnl_Abcde16a = 84,
    #[doc = " 4D tensor blocked by 1st and 2nd dimension with block size 8"]
    dnnl_Abcde32a = 85,
    #[doc = " 4D tensor blocked by 1st and 2nd dimension with block size 8"]
    dnnl_ABcde16a16b = 86,
    #[doc = " 4D tensor blocked by 1st and 2nd dimension with block size 8"]
    dnnl_BAcde8a16b2a = 87,
    #[doc = " 4D tensor blocked by 3rd dimension with block size 4"]
    dnnl_aBCd2b4c2b = 88,
    #[doc = " 5D tensor blocked by 1st dimension with block size 16"]
    dnnl_ABcde4b16a4b = 89,
    #[doc = " 5D tensor blocked by 1st dimension with block size 8"]
    dnnl_ABcde2b8a4b = 90,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 16"]
    dnnl_aBcde16b = 91,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 16"]
    dnnl_ABcde16b16a = 92,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 16"]
    dnnl_aBCde16b16c = 93,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 16"]
    dnnl_aBCde16c16b = 94,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 16"]
    dnnl_aBCde2c8b4c = 95,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 16"]
    dnnl_Abcde4a = 96,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 32"]
    dnnl_aBcde32b = 97,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBcde4b = 98,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 4"]
    dnnl_ABcde4b4a = 99,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 4"]
    dnnl_ABcde4a4b = 100,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBCde4b4c = 101,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBCde2c4b2c = 102,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBCde4b8c2b = 103,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBCde4c16b4c = 104,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBCde4c4b = 105,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 4"]
    dnnl_Abcde8a = 106,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 4"]
    dnnl_ABcde8a8b = 107,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 4"]
    dnnl_ABcde8a4b = 108,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 4"]
    dnnl_BAcde16b16a = 109,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 8"]
    dnnl_aBcde8b = 110,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 8"]
    dnnl_ABcde8b16a2b = 111,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 8"]
    dnnl_aBCde8b16c2b = 112,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 8"]
    dnnl_aBCde4c8b2c = 113,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 8"]
    dnnl_aCBde8b16c2b = 114,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 8"]
    dnnl_ABcde8b8a = 115,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 8"]
    dnnl_ABcde32a32b = 116,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 8"]
    dnnl_aBCde8b8c = 117,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 8"]
    dnnl_aBCde8b4c = 118,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 8"]
    dnnl_ABc4a8b8a4b = 119,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 8"]
    dnnl_ABcd4a8b8a4b = 120,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 8"]
    dnnl_ABcde4a8b8a4b = 121,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 8"]
    dnnl_BAc4b8a8b4a = 122,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 8"]
    dnnl_BAcd4b8a8b4a = 123,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 8"]
    dnnl_BAcde4b8a8b4a = 124,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 8"]
    dnnl_ABcd2a8b8a2b = 125,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 8"]
    dnnl_aBCd4b8c8b4c = 126,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 8"]
    dnnl_aBCde4b8c8b4c = 127,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 8"]
    dnnl_aBCde2b8c8b2c = 128,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 8"]
    dnnl_aBCde8c16b2c = 129,
    #[doc = " 5D tensor blocked by 2nd dimension with block size 8"]
    dnnl_aBCde8c8b = 130,
    #[doc = " 5D tensor blocked by 3rd dimension with block size 4"]
    dnnl_aBCde2b4c2b = 131,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 16"]
    dnnl_aBcdef16b = 132,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 16"]
    dnnl_aBCdef16b16c = 133,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 16"]
    dnnl_aBCdef16c16b = 134,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 16"]
    dnnl_aBCdef4c16b4c = 135,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 8"]
    dnnl_aBCdef2c8b4c = 136,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 8"]
    dnnl_aBCdef4c8b2c = 137,
    #[doc = " 6D tensor blocked by 3rd dimension with block size 4"]
    dnnl_aBCdef2b4c2b = 138,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBcdef4b = 139,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBCdef4c4b = 140,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBCdef4b4c = 141,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBCdef2c4b2c = 142,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBCdef4b8c2b = 143,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBCdef8b8c = 144,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBCdef8b4c = 145,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBCdef8c16b2c = 146,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBCdef4b8c8b4c = 147,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBCdef8b16c2b = 148,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aCBdef8b16c2b = 149,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBCdef8c8b = 150,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBdc16b = 151,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBdC16b2c = 152,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBdc4b = 153,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBdc8b = 154,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBdec16b = 155,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBdeC16b2c = 156,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBdec32b = 157,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBdec4b = 158,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBdec8b = 159,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBdefc16b = 160,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBdefC16b2c = 161,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aCBdef16c16b = 162,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBdefc4b = 163,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aBdefc8b = 164,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_Abcdef16a = 165,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_Abcdef32a = 166,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_Acb16a = 167,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_AcB16a2b = 168,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_Acb4a = 169,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_Acb8a = 170,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aCBd16b16c = 171,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aCBd16c16b = 172,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aCBde16b16c = 173,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aCBde16c16b = 174,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_Acdb16a = 175,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_AcdB16a2b = 176,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_Acdb32a = 177,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_Acdb4a = 178,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_Acdb8a = 179,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_Acdeb16a = 180,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_AcdeB16a2b = 181,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_Acdeb4a = 182,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_Acdeb8a = 183,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_BAc16a16b = 184,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_BAc16b16a = 185,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_BAcd16a16b = 186,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_BAcd16b16a = 187,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aCBd4c8b8c4b = 188,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aCBde4c8b8c4b = 189,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aCBdef4c8b8c4b = 190,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_BAcde16a16b = 191,
    #[doc = " 6D tensor blocked by 2nd dimension with block size 4"]
    dnnl_aCBdef16b16c = 192,
    #[doc = " Just a sentinel, not real memory format tag. Must be changed after new"]
    #[doc = " format tag is added."]
    dnnl_format_tag_last = 193,
}
impl dnnl_prop_kind_t {
    pub const dnnl_forward_scoring: dnnl_prop_kind_t = dnnl_prop_kind_t::dnnl_forward_inference;
}
impl dnnl_prop_kind_t {
    pub const dnnl_forward: dnnl_prop_kind_t = dnnl_prop_kind_t::dnnl_forward_training;
}
#[repr(u32)]
#[non_exhaustive]
#[doc = " Kinds of propagation."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum dnnl_prop_kind_t {
    #[doc = " Undefined propagation type."]
    dnnl_prop_kind_undef = 0,
    #[doc = " Forward data propagation (training mode). In this mode primitives"]
    #[doc = " perform computations necessary for subsequent backward propagation."]
    dnnl_forward_training = 64,
    #[doc = " Forward data propagation (inference mode). In this mode primitives"]
    #[doc = " perform only computations that are necessary for inference and omit"]
    #[doc = " computations that are necessary only for backward propagation."]
    dnnl_forward_inference = 96,
    #[doc = " Backward propagation (with respect to all parameters)."]
    dnnl_backward = 128,
    #[doc = " Backward data propagation."]
    dnnl_backward_data = 160,
    #[doc = " Backward weights propagation."]
    dnnl_backward_weights = 192,
    #[doc = " Backward bias propagation."]
    dnnl_backward_bias = 193,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = " Kinds of primitives. Used to implement a way to extend the library with new"]
#[doc = " primitives without changing the ABI."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum dnnl_primitive_kind_t {
    #[doc = " Undefined primitive"]
    dnnl_undefined_primitive = 0,
    #[doc = " A reorder primitive."]
    dnnl_reorder = 1,
    #[doc = " A shuffle primitive."]
    dnnl_shuffle = 2,
    #[doc = " A (out-of-place) concat primitive."]
    dnnl_concat = 3,
    #[doc = " A sum primitive."]
    dnnl_sum = 4,
    #[doc = " A convolution primitive."]
    dnnl_convolution = 5,
    #[doc = " A deconvolution primitive."]
    dnnl_deconvolution = 6,
    #[doc = " An element-wise primitive."]
    dnnl_eltwise = 7,
    #[doc = " A softmax primitive."]
    dnnl_softmax = 8,
    #[doc = " A pooling primitive."]
    dnnl_pooling = 9,
    #[doc = " An LRN primitive."]
    dnnl_lrn = 10,
    #[doc = " A batch normalization primitive."]
    dnnl_batch_normalization = 11,
    #[doc = " A layer normalization primitive."]
    dnnl_layer_normalization = 12,
    #[doc = " An inner product primitive."]
    dnnl_inner_product = 13,
    #[doc = " A rnn primitive."]
    dnnl_rnn = 14,
    #[doc = " A matrix multiplication primitive (internal)."]
    dnnl_gemm = 15,
    #[doc = " A binary primitive."]
    dnnl_binary = 16,
    #[doc = " A logsoftmax primitive."]
    dnnl_logsoftmax = 17,
    #[doc = " A matrix multiplication primitive."]
    dnnl_matmul = 18,
    #[doc = " A resampling primitive."]
    dnnl_resampling = 19,
}
impl dnnl_alg_kind_t {
    pub const dnnl_eltwise_gelu: dnnl_alg_kind_t = dnnl_alg_kind_t::dnnl_eltwise_gelu_tanh;
}
impl dnnl_alg_kind_t {
    pub const dnnl_pooling_avg: dnnl_alg_kind_t = dnnl_alg_kind_t::dnnl_pooling_avg_exclude_padding;
}
#[repr(u32)]
#[non_exhaustive]
#[doc = " Kinds of algorithms."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum dnnl_alg_kind_t {
    dnnl_alg_kind_undef = 0,
    #[doc = " Direct convolution"]
    dnnl_convolution_direct = 1,
    #[doc = " Winograd convolution"]
    dnnl_convolution_winograd = 2,
    #[doc = " Convolution algorithm(either direct or Winograd) is chosen just in time"]
    dnnl_convolution_auto = 3,
    #[doc = " Direct deconvolution"]
    dnnl_deconvolution_direct = 10,
    #[doc = " Winograd deconvolution"]
    dnnl_deconvolution_winograd = 11,
    #[doc = " Eltwise: ReLU"]
    dnnl_eltwise_relu = 31,
    #[doc = " Eltwise: hyperbolic tangent non-linearity (tanh)"]
    dnnl_eltwise_tanh = 47,
    #[doc = " Eltwise: exponential linear unit (elu)"]
    dnnl_eltwise_elu = 63,
    #[doc = " Eltwise: square"]
    dnnl_eltwise_square = 79,
    #[doc = " Eltwise: abs"]
    dnnl_eltwise_abs = 95,
    #[doc = " Eltwise: square root"]
    dnnl_eltwise_sqrt = 111,
    #[doc = " Eltwise: linear"]
    dnnl_eltwise_linear = 127,
    #[doc = " Eltwise: bounded_relu"]
    dnnl_eltwise_bounded_relu = 143,
    #[doc = " Eltwise: soft_relu"]
    dnnl_eltwise_soft_relu = 159,
    #[doc = " Eltwise: logistic"]
    dnnl_eltwise_logistic = 175,
    #[doc = " Eltwise: exponent"]
    dnnl_eltwise_exp = 191,
    #[doc = " Eltwise: gelu"]
    #[doc = ""]
    #[doc = " @note Tanh approximation formula is used to approximate"]
    #[doc = " the cumulative distribution function of a Gaussian here"]
    dnnl_eltwise_gelu_tanh = 207,
    #[doc = " Eltwise: swish"]
    dnnl_eltwise_swish = 223,
    #[doc = " Eltwise: natural logarithm"]
    dnnl_eltwise_log = 239,
    #[doc = " Eltwise: clip"]
    dnnl_eltwise_clip = 255,
    #[doc = " Eltwise: pow"]
    dnnl_eltwise_pow = 32,
    #[doc = " Eltwise: erf-based gelu"]
    dnnl_eltwise_gelu_erf = 48,
    #[doc = " Eltwise: round"]
    dnnl_eltwise_round = 64,
    #[doc = " Eltwise: ReLU (dst for backward)"]
    dnnl_eltwise_relu_use_dst_for_bwd = 256,
    #[doc = " Eltwise: hyperbolic tangent non-linearity (tanh) (dst for backward)"]
    dnnl_eltwise_tanh_use_dst_for_bwd = 257,
    #[doc = " Eltwise: exponential linear unit (elu) (dst for backward)"]
    dnnl_eltwise_elu_use_dst_for_bwd = 258,
    #[doc = " Eltwise: square root (dst for backward)"]
    dnnl_eltwise_sqrt_use_dst_for_bwd = 259,
    #[doc = " Eltwise: logistic (dst for backward)"]
    dnnl_eltwise_logistic_use_dst_for_bwd = 260,
    #[doc = " Eltwise: exp (dst for backward)"]
    dnnl_eltwise_exp_use_dst_for_bwd = 261,
    #[doc = " Max pooling"]
    dnnl_pooling_max = 511,
    #[doc = " Average pooling include padding"]
    dnnl_pooling_avg_include_padding = 767,
    #[doc = " Average pooling exclude padding"]
    dnnl_pooling_avg_exclude_padding = 1023,
    #[doc = " Local response normalization (LRN) across multiple channels"]
    dnnl_lrn_across_channels = 2815,
    #[doc = " LRN within a single channel"]
    dnnl_lrn_within_channel = 3071,
    #[doc = " RNN cell"]
    dnnl_vanilla_rnn = 8191,
    #[doc = " LSTM cell"]
    dnnl_vanilla_lstm = 12287,
    #[doc = " GRU cell"]
    dnnl_vanilla_gru = 16383,
    #[doc = " GRU cell with linear before reset"]
    #[doc = ""]
    #[doc = " Modification of original GRU cell. Differs from #dnnl_vanilla_gru"]
    #[doc = " in how the new memory gate is calculated:"]
    #[doc = " \\f[ c_t = tanh(W_c*x_t + b_{c_x} + r_t*(U_c*h_{t-1}+b_{c_h})) \\f]"]
    #[doc = " Primitive expects 4 biases on input:"]
    #[doc = " \\f$[b_{u}, b_{r}, b_{c_x}, b_{c_h}]\\f$"]
    dnnl_lbr_gru = 20479,
    #[doc = " Binary add"]
    dnnl_binary_add = 131056,
    #[doc = " Binary mul"]
    dnnl_binary_mul = 131057,
    #[doc = " Binary max"]
    dnnl_binary_max = 131058,
    #[doc = " Binary min"]
    dnnl_binary_min = 131059,
    #[doc = " Nearest Neighbor Resampling Method"]
    dnnl_resampling_nearest = 196592,
    #[doc = " Linear Resampling Method"]
    dnnl_resampling_linear = 196593,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = " Flags for normalization primitives."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum dnnl_normalization_flags_t {
    #[doc = " Use no normalization flags"]
    #[doc = ""]
    #[doc = " If specified"]
    #[doc = "  - on forward training propagation mean and variance are computed and"]
    #[doc = "    stored as output"]
    #[doc = "  - on backward propagation compute full derivative wrt data"]
    #[doc = "  - on backward propagation prop_kind == #dnnl_backward_data has the same"]
    #[doc = "    behavior as prop_kind == #dnnl_backward"]
    dnnl_normalization_flags_none = 0,
    #[doc = " Use global statistics"]
    #[doc = ""]
    #[doc = " If specified"]
    #[doc = "  - on forward propagation use mean and variance provided by user (input)"]
    #[doc = "  - on backward propagation reduces the amount of computations, since"]
    #[doc = "    mean and variance are considered as constants"]
    #[doc = ""]
    #[doc = "  If not specified:"]
    #[doc = "   - on forward propagation mean and variance are computed and stored as"]
    #[doc = "     output"]
    #[doc = "   - on backward propagation compute full derivative wrt data"]
    dnnl_use_global_stats = 1,
    #[doc = " Use scale and shift parameters"]
    #[doc = ""]
    #[doc = " If specified:"]
    #[doc = "  - on forward propagation use scale and shift (aka scale and bias) for"]
    #[doc = "    the batch normalization results"]
    #[doc = "  - on backward propagation (for prop_kind == #dnnl_backward) compute"]
    #[doc = "    diff wrt scale and shift (hence one extra output used)"]
    #[doc = ""]
    #[doc = " If no specified:"]
    #[doc = "  - on backward propagation prop_kind == #dnnl_backward_data has the"]
    #[doc = "    same behavior as prop_kind == #dnnl_backward"]
    dnnl_use_scaleshift = 2,
    #[doc = " Fuse with ReLU"]
    #[doc = ""]
    #[doc = " The flag implies negative slope being 0. On training this is the only"]
    #[doc = " configuration supported. For inference, to use non-zero negative slope"]
    #[doc = " consider using @ref dev_guide_attributes_post_ops."]
    #[doc = ""]
    #[doc = " If specified:"]
    #[doc = "  - on inference this option behaves the same as if the primitive were"]
    #[doc = "    fused with ReLU using post ops API with zero negative slope."]
    #[doc = "  - on training primitive requires workspace (required to be able to"]
    #[doc = "    perform backward pass)"]
    dnnl_fuse_norm_relu = 4,
}
#[doc = " @cond DO_NOT_DOCUMENT_THIS"]
#[doc = " Hex representation for a **special** quiet NAN (!= NAN from math.h)"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union _bindgen_ty_1 {
    pub u: ::libc::c_uint,
    pub f: f32,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<_bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(_bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<_bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(_bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_bindgen_ty_1>())).u as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_bindgen_ty_1),
            "::",
            stringify!(u)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_bindgen_ty_1>())).f as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_bindgen_ty_1),
            "::",
            stringify!(f)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZL24DNNL_RUNTIME_F32_VAL_REP"]
    pub static DNNL_RUNTIME_F32_VAL_REP: _bindgen_ty_1;
}
pub const DNNL_RUNTIME_S32_VAL_REP: ::libc::c_int = -2147483648;
#[doc = " A type to describe tensor dimension."]
pub type dnnl_dim_t = i64;
#[doc = " A type to describe tensor dimensions."]
pub type dnnl_dims_t = [dnnl_dim_t; 12usize];
#[doc = " Generic description of blocked data layout for most memory formats."]
#[doc = ""]
#[doc = " @sa @ref dev_guide_understanding_memory_formats"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dnnl_blocking_desc_t {
    #[doc = " The strides between the outermost blocks."]
    #[doc = " In case of plain (non-blocked) formats the strides between dimensions."]
    pub strides: dnnl_dims_t,
    #[doc = " The number of innermost blocks, e.g. 3 in case of `OIhw_4i16o4i_`"]
    pub inner_nblks: ::libc::c_int,
    #[doc = " The size of the blocks, e.g. `{4, 16, 4}` in case of `OIhw_4i16o4i`"]
    pub inner_blks: dnnl_dims_t,
    #[doc = " The logical indices of the blocks, e.g. `{1, 0, 1}` in case of"]
    #[doc = " `4i16o4i`, because `i` is the 1st dim and `o` is the 0st dim"]
    pub inner_idxs: dnnl_dims_t,
}
#[test]
fn bindgen_test_layout_dnnl_blocking_desc_t() {
    assert_eq!(
        ::std::mem::size_of::<dnnl_blocking_desc_t>(),
        296usize,
        concat!("Size of: ", stringify!(dnnl_blocking_desc_t))
    );
    assert_eq!(
        ::std::mem::align_of::<dnnl_blocking_desc_t>(),
        8usize,
        concat!("Alignment of ", stringify!(dnnl_blocking_desc_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_blocking_desc_t>())).strides as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_blocking_desc_t),
            "::",
            stringify!(strides)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_blocking_desc_t>())).inner_nblks as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_blocking_desc_t),
            "::",
            stringify!(inner_nblks)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_blocking_desc_t>())).inner_blks as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_blocking_desc_t),
            "::",
            stringify!(inner_blks)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_blocking_desc_t>())).inner_idxs as *const _ as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_blocking_desc_t),
            "::",
            stringify!(inner_idxs)
        )
    );
}
#[repr(u32)]
#[non_exhaustive]
#[doc = " Winograd-specific formats"]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum dnnl_wino_memory_format_t {
    #[doc = " Undefined memory format, used for empty memory descriptors."]
    dnnl_wino_undef = 0,
    #[doc = "< Internal weights format for 2x3 Winograd"]
    dnnl_wino_wei_aaOIoi = 1,
    #[doc = "< Internal weights format for 2x3 Winograd"]
    dnnl_wino_wei_aaOio = 2,
    #[doc = "< Internal weights format for 2x3 Winograd"]
    dnnl_wino_wei_aaOBiOo = 3,
    #[doc = "< Internal weights format for 4x3 Winograd"]
    dnnl_wino_wei_OBaaIBOIio = 4,
}
#[doc = " Description of tensor of weights for winograd 2x3 convolution."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dnnl_wino_desc_t {
    pub wino_format: dnnl_wino_memory_format_t,
    pub r: ::libc::c_int,
    pub alpha: ::libc::c_int,
    pub ic: ::libc::c_int,
    pub oc: ::libc::c_int,
    pub ic_block: ::libc::c_int,
    pub oc_block: ::libc::c_int,
    pub ic2_block: ::libc::c_int,
    pub oc2_block: ::libc::c_int,
    pub adj_scale: f32,
    pub size: usize,
}
#[test]
fn bindgen_test_layout_dnnl_wino_desc_t() {
    assert_eq!(
        ::std::mem::size_of::<dnnl_wino_desc_t>(),
        48usize,
        concat!("Size of: ", stringify!(dnnl_wino_desc_t))
    );
    assert_eq!(
        ::std::mem::align_of::<dnnl_wino_desc_t>(),
        8usize,
        concat!("Alignment of ", stringify!(dnnl_wino_desc_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_wino_desc_t>())).wino_format as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_wino_desc_t),
            "::",
            stringify!(wino_format)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_wino_desc_t>())).r as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_wino_desc_t),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_wino_desc_t>())).alpha as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_wino_desc_t),
            "::",
            stringify!(alpha)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_wino_desc_t>())).ic as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_wino_desc_t),
            "::",
            stringify!(ic)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_wino_desc_t>())).oc as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_wino_desc_t),
            "::",
            stringify!(oc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_wino_desc_t>())).ic_block as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_wino_desc_t),
            "::",
            stringify!(ic_block)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_wino_desc_t>())).oc_block as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_wino_desc_t),
            "::",
            stringify!(oc_block)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_wino_desc_t>())).ic2_block as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_wino_desc_t),
            "::",
            stringify!(ic2_block)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_wino_desc_t>())).oc2_block as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_wino_desc_t),
            "::",
            stringify!(oc2_block)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_wino_desc_t>())).adj_scale as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_wino_desc_t),
            "::",
            stringify!(adj_scale)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_wino_desc_t>())).size as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_wino_desc_t),
            "::",
            stringify!(size)
        )
    );
}
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum dnnl_rnn_packed_memory_format_t {
    dnnl_packed_format_undef = 0,
    dnnl_ldigo_p = 1,
    dnnl_ldgoi_p = 2,
}
#[doc = " Description of tensor of packed weights for rnn."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct dnnl_rnn_packed_desc_t {
    pub format: dnnl_rnn_packed_memory_format_t,
    pub n_parts: ::libc::c_int,
    pub n: ::libc::c_int,
    pub ldb: ::libc::c_int,
    pub parts: [::libc::c_int; 4usize],
    pub part_pack_size: [usize; 4usize],
    pub pack_part: [::libc::c_uint; 4usize],
    pub offset_compensation: usize,
    pub size: usize,
    pub reserved: [::libc::c_char; 200usize],
}
#[test]
fn bindgen_test_layout_dnnl_rnn_packed_desc_t() {
    assert_eq!(
        ::std::mem::size_of::<dnnl_rnn_packed_desc_t>(),
        296usize,
        concat!("Size of: ", stringify!(dnnl_rnn_packed_desc_t))
    );
    assert_eq!(
        ::std::mem::align_of::<dnnl_rnn_packed_desc_t>(),
        8usize,
        concat!("Alignment of ", stringify!(dnnl_rnn_packed_desc_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_rnn_packed_desc_t>())).format as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_packed_desc_t),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_rnn_packed_desc_t>())).n_parts as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_packed_desc_t),
            "::",
            stringify!(n_parts)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_rnn_packed_desc_t>())).n as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_packed_desc_t),
            "::",
            stringify!(n)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_rnn_packed_desc_t>())).ldb as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_packed_desc_t),
            "::",
            stringify!(ldb)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_rnn_packed_desc_t>())).parts as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_packed_desc_t),
            "::",
            stringify!(parts)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_rnn_packed_desc_t>())).part_pack_size as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_packed_desc_t),
            "::",
            stringify!(part_pack_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_rnn_packed_desc_t>())).pack_part as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_packed_desc_t),
            "::",
            stringify!(pack_part)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_rnn_packed_desc_t>())).offset_compensation as *const _
                as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_packed_desc_t),
            "::",
            stringify!(offset_compensation)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_rnn_packed_desc_t>())).size as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_packed_desc_t),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_rnn_packed_desc_t>())).reserved as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_packed_desc_t),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(u32)]
#[non_exhaustive]
#[doc = " Flags for memory special features"]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum dnnl_memory_extra_flags_t {
    dnnl_memory_extra_flag_none = 0,
    #[doc = " Indicates the weights have an additional buffer, that depends on the"]
    #[doc = " @p compensation_mask."]
    #[doc = ""]
    #[doc = " For instance, in 4D case with the compensation mask equals (1 << 0)"]
    #[doc = " the additional buffer would consist of OC values:"]
    #[doc = " O[oc : 0,OC] ="]
    #[doc = "  -128 * SUM(ic : 0,IC; kh : 0,KH; kw : 0,KW){ weights(oc, ic, kh, kw) }"]
    dnnl_memory_extra_flag_compensation_conv_s8s8 = 1,
    #[doc = " Indicates the weights have an additional buffer, that depends on the"]
    #[doc = " @p compensation_mask."]
    #[doc = ""]
    #[doc = " For instance, in 4D case with the compensation mask equals (1 << 0)"]
    #[doc = " the additional buffer would consist of OC values:"]
    #[doc = " O[oc : 0,OC] ="]
    #[doc = "  -128 * SUM(ic : 0,IC; kh : 0,KH; kw : 0,KW){ weights(oc, ic, kh, kw) }"]
    dnnl_memory_extra_flag_scale_adjust = 2,
    #[doc = " Indicates the weights have an additional buffer, that depends on the"]
    #[doc = " @p compensation_mask."]
    #[doc = ""]
    #[doc = " For instance, in 4D case with the compensation mask equals (1 << 0)"]
    #[doc = " the additional buffer would consist of OC values:"]
    #[doc = " O[oc : 0,OC] ="]
    #[doc = "  -128 * SUM(ic : 0,IC; kh : 0,KH; kw : 0,KW){ weights(oc, ic, kh, kw) }"]
    dnnl_memory_extra_flag_gpu_rnn_u8s8_compensation = 4,
}
#[doc = " Description of extra information stored in memory"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct dnnl_memory_extra_desc_t {
    #[doc = " The flags contain arbitrary extra information, such as compensation."]
    #[doc = " @sa dnnl_memory_extra_flags_t"]
    pub flags: u64,
    #[doc = " Compensation mask"]
    pub compensation_mask: ::libc::c_int,
    #[doc = " Scale applied to the data"]
    pub scale_adjust: f32,
    #[doc = " For future backwards compatibility"]
    pub reserved: [::libc::c_char; 64usize],
}
#[test]
fn bindgen_test_layout_dnnl_memory_extra_desc_t() {
    assert_eq!(
        ::std::mem::size_of::<dnnl_memory_extra_desc_t>(),
        80usize,
        concat!("Size of: ", stringify!(dnnl_memory_extra_desc_t))
    );
    assert_eq!(
        ::std::mem::align_of::<dnnl_memory_extra_desc_t>(),
        8usize,
        concat!("Alignment of ", stringify!(dnnl_memory_extra_desc_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_memory_extra_desc_t>())).flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_memory_extra_desc_t),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_memory_extra_desc_t>())).compensation_mask as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_memory_extra_desc_t),
            "::",
            stringify!(compensation_mask)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_memory_extra_desc_t>())).scale_adjust as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_memory_extra_desc_t),
            "::",
            stringify!(scale_adjust)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_memory_extra_desc_t>())).reserved as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_memory_extra_desc_t),
            "::",
            stringify!(reserved)
        )
    );
}
#[doc = " Memory descriptor. The description is based on a number of dimensions,"]
#[doc = " dimensions themselves, plus information about elements type and memory"]
#[doc = " format. Additionally, contains format-specific descriptions of the data"]
#[doc = " layout."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct dnnl_memory_desc_t {
    #[doc = " Number of dimensions"]
    pub ndims: ::libc::c_int,
    #[doc = " Dimensions in the following order:"]
    #[doc = " - CNN data tensors: mini-batch, channel, spatial"]
    #[doc = "   (<code>{N, C, [[D,] H,] W}</code>)"]
    #[doc = " - CNN weight tensors: group (optional), output channel, input channel,"]
    #[doc = "   spatial (<code>{[G,] O, I, [[D,] H,] W}</code>)"]
    #[doc = " - RNN data tensors: time, mini-batch, channels (<code>{T, N, C}</code>)"]
    #[doc = "   or layers, directions, states, mini-batch, channels (<code>{L, D, S, N, C}</code>)"]
    #[doc = " - RNN weight tensor: layers, directions, input channel, gates, output channels"]
    #[doc = "   (<code>{L, D, I, G, O}</code>)."]
    #[doc = ""]
    #[doc = " @note"]
    #[doc = "    The order of dimensions does not depend on the memory format, so"]
    #[doc = "    whether the data is laid out in #dnnl_nchw or #dnnl_nhwc"]
    #[doc = "    the dims for 4D CN data tensor would be <code>{N, C, H, W}</code>."]
    pub dims: dnnl_dims_t,
    #[doc = " Data type of the tensor elements."]
    pub data_type: dnnl_data_type_t,
    #[doc = " Size of the data including padding in each dimension."]
    pub padded_dims: dnnl_dims_t,
    #[doc = " Per-dimension offset from the padding to actual data, the top-level"]
    #[doc = " tensor with offsets applied must lie within the padding area."]
    pub padded_offsets: dnnl_dims_t,
    #[doc = " Offset from memory origin to the current block, non-zero only in"]
    #[doc = " a description of a memory sub-block."]
    pub offset0: dnnl_dim_t,
    #[doc = " Memory format kind."]
    pub format_kind: dnnl_format_kind_t,
    pub format_desc: dnnl_memory_desc_t__bindgen_ty_1,
    pub extra: dnnl_memory_extra_desc_t,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union dnnl_memory_desc_t__bindgen_ty_1 {
    #[doc = " Description of the data layout for memory formats that use"]
    #[doc = " blocking."]
    pub blocking: dnnl_blocking_desc_t,
    #[doc = " Tensor of weights for integer 8bit winograd convolution."]
    pub wino_desc: dnnl_wino_desc_t,
    #[doc = " Tensor of packed weights for RNN."]
    pub rnn_packed_desc: dnnl_rnn_packed_desc_t,
    _bindgen_union_align: [u64; 37usize],
}
#[test]
fn bindgen_test_layout_dnnl_memory_desc_t__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<dnnl_memory_desc_t__bindgen_ty_1>(),
        296usize,
        concat!("Size of: ", stringify!(dnnl_memory_desc_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<dnnl_memory_desc_t__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(dnnl_memory_desc_t__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_memory_desc_t__bindgen_ty_1>())).blocking as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_memory_desc_t__bindgen_ty_1),
            "::",
            stringify!(blocking)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_memory_desc_t__bindgen_ty_1>())).wino_desc as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_memory_desc_t__bindgen_ty_1),
            "::",
            stringify!(wino_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_memory_desc_t__bindgen_ty_1>())).rnn_packed_desc as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_memory_desc_t__bindgen_ty_1),
            "::",
            stringify!(rnn_packed_desc)
        )
    );
}
#[test]
fn bindgen_test_layout_dnnl_memory_desc_t() {
    assert_eq!(
        ::std::mem::size_of::<dnnl_memory_desc_t>(),
        696usize,
        concat!("Size of: ", stringify!(dnnl_memory_desc_t))
    );
    assert_eq!(
        ::std::mem::align_of::<dnnl_memory_desc_t>(),
        8usize,
        concat!("Alignment of ", stringify!(dnnl_memory_desc_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_memory_desc_t>())).ndims as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_memory_desc_t),
            "::",
            stringify!(ndims)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_memory_desc_t>())).dims as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_memory_desc_t),
            "::",
            stringify!(dims)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_memory_desc_t>())).data_type as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_memory_desc_t),
            "::",
            stringify!(data_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_memory_desc_t>())).padded_dims as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_memory_desc_t),
            "::",
            stringify!(padded_dims)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_memory_desc_t>())).padded_offsets as *const _ as usize
        },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_memory_desc_t),
            "::",
            stringify!(padded_offsets)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_memory_desc_t>())).offset0 as *const _ as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_memory_desc_t),
            "::",
            stringify!(offset0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_memory_desc_t>())).format_kind as *const _ as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_memory_desc_t),
            "::",
            stringify!(format_kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_memory_desc_t>())).format_desc as *const _ as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_memory_desc_t),
            "::",
            stringify!(format_desc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_memory_desc_t>())).extra as *const _ as usize },
        616usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_memory_desc_t),
            "::",
            stringify!(extra)
        )
    );
}
#[doc = " @struct dnnl_memory"]
#[doc = " An opaque structure to describe a memory."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dnnl_memory {
    _unused: [u8; 0],
}
#[doc = " A memory handle."]
pub type dnnl_memory_t = *mut dnnl_memory;
#[doc = " A constant memory handle."]
pub type const_dnnl_memory_t = *const dnnl_memory;
#[doc = " A pointer to any of the operation descriptors."]
pub type dnnl_op_desc_t = *mut ::libc::c_void;
#[doc = " A pointer to any of the operation descriptors (constant variant)."]
pub type const_dnnl_op_desc_t = *const ::libc::c_void;
#[doc = " A descriptor of a convolution operation."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct dnnl_convolution_desc_t {
    #[doc = " The kind of primitive. Used for self-identifying the primitive"]
    #[doc = " descriptor. Must be #dnnl_convolution."]
    pub primitive_kind: dnnl_primitive_kind_t,
    #[doc = " The kind of propagation. Possible values: #dnnl_forward_training,"]
    #[doc = " #dnnl_forward_inference, #dnnl_backward_data,"]
    #[doc = " #dnnl_backward_weights, and #dnnl_backward_bias."]
    pub prop_kind: dnnl_prop_kind_t,
    #[doc = " The kind of the convolution algorithm. Possible values:"]
    #[doc = " #dnnl_convolution_direct."]
    pub alg_kind: dnnl_alg_kind_t,
    #[doc = " Source memory descriptor."]
    pub src_desc: dnnl_memory_desc_t,
    #[doc = " Source gradient memory descriptor."]
    pub diff_src_desc: dnnl_memory_desc_t,
    #[doc = " Weights memory descriptor."]
    pub weights_desc: dnnl_memory_desc_t,
    #[doc = " Weights gradient memory descriptor."]
    pub diff_weights_desc: dnnl_memory_desc_t,
    #[doc = " Bias memory descriptor."]
    pub bias_desc: dnnl_memory_desc_t,
    #[doc = " Bias gradient memory descriptor."]
    pub diff_bias_desc: dnnl_memory_desc_t,
    #[doc = " Destination memory descriptor."]
    pub dst_desc: dnnl_memory_desc_t,
    #[doc = " Destination gradient memory descriptor."]
    pub diff_dst_desc: dnnl_memory_desc_t,
    #[doc = " Convolution strides in each spatial dimension."]
    pub strides: dnnl_dims_t,
    #[doc = " Convolution dilates in each spatial dimension."]
    pub dilates: dnnl_dims_t,
    #[doc = " Padding in each spatial dimension. padding[0] is a padding in the"]
    #[doc = " beginning (@p padding_l), padding[1] is a padding in the end (@p"]
    #[doc = " padding_r)."]
    pub padding: [dnnl_dims_t; 2usize],
    #[doc = " The accumulator data type. Initialized automatically."]
    pub accum_data_type: dnnl_data_type_t,
}
#[test]
fn bindgen_test_layout_dnnl_convolution_desc_t() {
    assert_eq!(
        ::std::mem::size_of::<dnnl_convolution_desc_t>(),
        5976usize,
        concat!("Size of: ", stringify!(dnnl_convolution_desc_t))
    );
    assert_eq!(
        ::std::mem::align_of::<dnnl_convolution_desc_t>(),
        8usize,
        concat!("Alignment of ", stringify!(dnnl_convolution_desc_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_convolution_desc_t>())).primitive_kind as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_convolution_desc_t),
            "::",
            stringify!(primitive_kind)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_convolution_desc_t>())).prop_kind as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_convolution_desc_t),
            "::",
            stringify!(prop_kind)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_convolution_desc_t>())).alg_kind as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_convolution_desc_t),
            "::",
            stringify!(alg_kind)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_convolution_desc_t>())).src_desc as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_convolution_desc_t),
            "::",
            stringify!(src_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_convolution_desc_t>())).diff_src_desc as *const _ as usize
        },
        712usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_convolution_desc_t),
            "::",
            stringify!(diff_src_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_convolution_desc_t>())).weights_desc as *const _ as usize
        },
        1408usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_convolution_desc_t),
            "::",
            stringify!(weights_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_convolution_desc_t>())).diff_weights_desc as *const _
                as usize
        },
        2104usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_convolution_desc_t),
            "::",
            stringify!(diff_weights_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_convolution_desc_t>())).bias_desc as *const _ as usize
        },
        2800usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_convolution_desc_t),
            "::",
            stringify!(bias_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_convolution_desc_t>())).diff_bias_desc as *const _ as usize
        },
        3496usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_convolution_desc_t),
            "::",
            stringify!(diff_bias_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_convolution_desc_t>())).dst_desc as *const _ as usize
        },
        4192usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_convolution_desc_t),
            "::",
            stringify!(dst_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_convolution_desc_t>())).diff_dst_desc as *const _ as usize
        },
        4888usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_convolution_desc_t),
            "::",
            stringify!(diff_dst_desc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_convolution_desc_t>())).strides as *const _ as usize },
        5584usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_convolution_desc_t),
            "::",
            stringify!(strides)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_convolution_desc_t>())).dilates as *const _ as usize },
        5680usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_convolution_desc_t),
            "::",
            stringify!(dilates)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_convolution_desc_t>())).padding as *const _ as usize },
        5776usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_convolution_desc_t),
            "::",
            stringify!(padding)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_convolution_desc_t>())).accum_data_type as *const _ as usize
        },
        5968usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_convolution_desc_t),
            "::",
            stringify!(accum_data_type)
        )
    );
}
#[doc = " A descriptor of a deconvolution operation."]
pub type dnnl_deconvolution_desc_t = dnnl_convolution_desc_t;
#[doc = " A descriptor of a shuffle operation."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct dnnl_shuffle_desc_t {
    #[doc = " The kind of primitive. Used for self-identifying the primitive"]
    #[doc = " descriptor. Must be #dnnl_shuffle."]
    pub primitive_kind: dnnl_primitive_kind_t,
    #[doc = " The kind of propagation. Possible values: #dnnl_forward_training,"]
    #[doc = " #dnnl_forward_inference, and #dnnl_backward_data."]
    pub prop_kind: dnnl_prop_kind_t,
    #[doc = " Source and destination memory descriptor,"]
    #[doc = " and source and destination gradient memory descriptor."]
    pub data_desc: dnnl_memory_desc_t,
    #[doc = " Axis for shuffling."]
    pub axis: ::libc::c_int,
    #[doc = " Number of groups."]
    pub group_size: dnnl_dim_t,
}
#[test]
fn bindgen_test_layout_dnnl_shuffle_desc_t() {
    assert_eq!(
        ::std::mem::size_of::<dnnl_shuffle_desc_t>(),
        720usize,
        concat!("Size of: ", stringify!(dnnl_shuffle_desc_t))
    );
    assert_eq!(
        ::std::mem::align_of::<dnnl_shuffle_desc_t>(),
        8usize,
        concat!("Alignment of ", stringify!(dnnl_shuffle_desc_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_shuffle_desc_t>())).primitive_kind as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_shuffle_desc_t),
            "::",
            stringify!(primitive_kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_shuffle_desc_t>())).prop_kind as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_shuffle_desc_t),
            "::",
            stringify!(prop_kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_shuffle_desc_t>())).data_desc as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_shuffle_desc_t),
            "::",
            stringify!(data_desc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_shuffle_desc_t>())).axis as *const _ as usize },
        704usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_shuffle_desc_t),
            "::",
            stringify!(axis)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_shuffle_desc_t>())).group_size as *const _ as usize },
        712usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_shuffle_desc_t),
            "::",
            stringify!(group_size)
        )
    );
}
#[doc = " A descriptor of a element-wise operation."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct dnnl_eltwise_desc_t {
    #[doc = " The kind of primitive. Used for self-identifying the primitive"]
    #[doc = " descriptor. Must be #dnnl_eltwise."]
    pub primitive_kind: dnnl_primitive_kind_t,
    #[doc = " The kind of propagation. Possible values: #dnnl_forward_training,"]
    #[doc = " #dnnl_forward_inference, #dnnl_backward, and #dnnl_backward_data."]
    pub prop_kind: dnnl_prop_kind_t,
    #[doc = " The kind of eltwise algorithm. Possible values: #dnnl_eltwise_relu,"]
    #[doc = " #dnnl_eltwise_tanh, #dnnl_eltwise_elu, #dnnl_eltwise_square,"]
    #[doc = " #dnnl_eltwise_abs, #dnnl_eltwise_sqrt, #dnnl_eltwise_linear,"]
    #[doc = " #dnnl_eltwise_bounded_relu, #dnnl_eltwise_soft_relu,"]
    #[doc = " #dnnl_eltwise_logistic, #dnnl_eltwise_exp, #dnnl_eltwise_gelu_tanh,"]
    #[doc = " #dnnl_eltwise_swish, #dnnl_eltwise_log, #dnnl_eltwise_clip,"]
    #[doc = " #dnnl_eltwise_pow, #dnnl_eltwise_gelu_erf, #dnnl_eltwise_round."]
    #[doc = " Possible values for passing destination memory on backward:"]
    #[doc = " #dnnl_eltwise_relu_use_dst_for_bwd, #dnnl_eltwise_tanh_use_dst_for_bwd,"]
    #[doc = " #dnnl_eltwise_elu_use_dst_for_bwd, #dnnl_eltwise_sqrt_use_dst_for_bwd,"]
    #[doc = " #dnnl_eltwise_logistic_use_dst_for_bwd,"]
    #[doc = " #dnnl_eltwise_exp_use_dst_for_bwd."]
    pub alg_kind: dnnl_alg_kind_t,
    #[doc = " Source and destination memory descriptor."]
    pub data_desc: dnnl_memory_desc_t,
    #[doc = " Source and destination gradient memory descriptor."]
    pub diff_data_desc: dnnl_memory_desc_t,
    #[doc = " Algorithm specific parameter."]
    #[doc = " Accordance table:"]
    #[doc = "  - #dnnl_eltwise_relu: @p alpha -- negative slope, @p beta ignored"]
    #[doc = "  - #dnnl_eltwise_tanh: @p alpha and @p beta ignored"]
    #[doc = "  - #dnnl_eltwise_elu: @p alpha -- negative slope, @p beta ignored"]
    #[doc = "  - #dnnl_eltwise_square: @p alpha and @p beta ignored"]
    #[doc = "  - #dnnl_eltwise_abs: @p alpha and @p beta ignored"]
    #[doc = "  - #dnnl_eltwise_sqrt: @p alpha and @p beta ignored"]
    #[doc = "  - #dnnl_eltwise_linear: @p alpha -- scale, @p beta -- shift"]
    #[doc = "  - #dnnl_eltwise_bounded_relu: @p alpha -- upper bound, @p beta ignored"]
    #[doc = "  - #dnnl_eltwise_soft_relu: @p alpha and @p beta ignored"]
    #[doc = "  - #dnnl_eltwise_logistic: @p alpha and @p beta ignored"]
    #[doc = "  - #dnnl_eltwise_exp: @p alpha and @p beta ignored"]
    #[doc = "  - #dnnl_eltwise_gelu_tanh: @p alpha and @p beta ignored"]
    #[doc = "  - #dnnl_eltwise_swish: @p alpha -- sigmoid arg scaling, @p beta ignored"]
    #[doc = "  - #dnnl_eltwise_log: @p alpha and @p beta ignored"]
    #[doc = "  - #dnnl_eltwise_clip: @p alpha -- lower bound, @p beta -- upper bound"]
    #[doc = "  - #dnnl_eltwise_pow: @p alpha -- scale, @p beta -- exponent"]
    #[doc = "  - #dnnl_eltwise_gelu_erf: @p alpha and @p beta ignored"]
    #[doc = "  - #dnnl_eltwise_round: @p alpha and @p beta ignored"]
    pub alpha: f32,
    #[doc = " Algorithm specific parameter."]
    #[doc = " Accordance table:"]
    #[doc = "  - #dnnl_eltwise_relu: @p alpha -- negative slope, @p beta ignored"]
    #[doc = "  - #dnnl_eltwise_tanh: @p alpha and @p beta ignored"]
    #[doc = "  - #dnnl_eltwise_elu: @p alpha -- negative slope, @p beta ignored"]
    #[doc = "  - #dnnl_eltwise_square: @p alpha and @p beta ignored"]
    #[doc = "  - #dnnl_eltwise_abs: @p alpha and @p beta ignored"]
    #[doc = "  - #dnnl_eltwise_sqrt: @p alpha and @p beta ignored"]
    #[doc = "  - #dnnl_eltwise_linear: @p alpha -- scale, @p beta -- shift"]
    #[doc = "  - #dnnl_eltwise_bounded_relu: @p alpha -- upper bound, @p beta ignored"]
    #[doc = "  - #dnnl_eltwise_soft_relu: @p alpha and @p beta ignored"]
    #[doc = "  - #dnnl_eltwise_logistic: @p alpha and @p beta ignored"]
    #[doc = "  - #dnnl_eltwise_exp: @p alpha and @p beta ignored"]
    #[doc = "  - #dnnl_eltwise_gelu_tanh: @p alpha and @p beta ignored"]
    #[doc = "  - #dnnl_eltwise_swish: @p alpha -- sigmoid arg scaling, @p beta ignored"]
    #[doc = "  - #dnnl_eltwise_log: @p alpha and @p beta ignored"]
    #[doc = "  - #dnnl_eltwise_clip: @p alpha -- lower bound, @p beta -- upper bound"]
    #[doc = "  - #dnnl_eltwise_pow: @p alpha -- scale, @p beta -- exponent"]
    #[doc = "  - #dnnl_eltwise_gelu_erf: @p alpha and @p beta ignored"]
    #[doc = "  - #dnnl_eltwise_round: @p alpha and @p beta ignored"]
    pub beta: f32,
}
#[test]
fn bindgen_test_layout_dnnl_eltwise_desc_t() {
    assert_eq!(
        ::std::mem::size_of::<dnnl_eltwise_desc_t>(),
        1416usize,
        concat!("Size of: ", stringify!(dnnl_eltwise_desc_t))
    );
    assert_eq!(
        ::std::mem::align_of::<dnnl_eltwise_desc_t>(),
        8usize,
        concat!("Alignment of ", stringify!(dnnl_eltwise_desc_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_eltwise_desc_t>())).primitive_kind as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_eltwise_desc_t),
            "::",
            stringify!(primitive_kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_eltwise_desc_t>())).prop_kind as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_eltwise_desc_t),
            "::",
            stringify!(prop_kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_eltwise_desc_t>())).alg_kind as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_eltwise_desc_t),
            "::",
            stringify!(alg_kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_eltwise_desc_t>())).data_desc as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_eltwise_desc_t),
            "::",
            stringify!(data_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_eltwise_desc_t>())).diff_data_desc as *const _ as usize
        },
        712usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_eltwise_desc_t),
            "::",
            stringify!(diff_data_desc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_eltwise_desc_t>())).alpha as *const _ as usize },
        1408usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_eltwise_desc_t),
            "::",
            stringify!(alpha)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_eltwise_desc_t>())).beta as *const _ as usize },
        1412usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_eltwise_desc_t),
            "::",
            stringify!(beta)
        )
    );
}
#[doc = " A descriptor of a Softmax operation."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct dnnl_softmax_desc_t {
    #[doc = " The kind of primitive. Used for self-identifying the primitive"]
    #[doc = " descriptor. Must be #dnnl_softmax."]
    pub primitive_kind: dnnl_primitive_kind_t,
    #[doc = " The kind of propagation. Possible values: #dnnl_forward_training and"]
    #[doc = " #dnnl_forward_inference."]
    pub prop_kind: dnnl_prop_kind_t,
    #[doc = " Source and destination memory descriptor."]
    pub data_desc: dnnl_memory_desc_t,
    #[doc = " Source and Destination of gradient memory descriptor."]
    pub diff_desc: dnnl_memory_desc_t,
    #[doc = " The axis along which to perform the softmax."]
    pub softmax_axis: ::libc::c_int,
}
#[test]
fn bindgen_test_layout_dnnl_softmax_desc_t() {
    assert_eq!(
        ::std::mem::size_of::<dnnl_softmax_desc_t>(),
        1408usize,
        concat!("Size of: ", stringify!(dnnl_softmax_desc_t))
    );
    assert_eq!(
        ::std::mem::align_of::<dnnl_softmax_desc_t>(),
        8usize,
        concat!("Alignment of ", stringify!(dnnl_softmax_desc_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_softmax_desc_t>())).primitive_kind as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_softmax_desc_t),
            "::",
            stringify!(primitive_kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_softmax_desc_t>())).prop_kind as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_softmax_desc_t),
            "::",
            stringify!(prop_kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_softmax_desc_t>())).data_desc as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_softmax_desc_t),
            "::",
            stringify!(data_desc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_softmax_desc_t>())).diff_desc as *const _ as usize },
        704usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_softmax_desc_t),
            "::",
            stringify!(diff_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_softmax_desc_t>())).softmax_axis as *const _ as usize
        },
        1400usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_softmax_desc_t),
            "::",
            stringify!(softmax_axis)
        )
    );
}
#[doc = " A descriptor of a LogSoftmax operation. An alias of Softmax structure, but"]
#[doc = " primitive_kind must be #dnnl_logsoftmax."]
pub type dnnl_logsoftmax_desc_t = dnnl_softmax_desc_t;
#[doc = " A descriptor of a pooling operation."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct dnnl_pooling_desc_t {
    #[doc = " The kind of primitive. Used for self-identifying the primitive"]
    #[doc = " descriptor. Must be #dnnl_pooling."]
    pub primitive_kind: dnnl_primitive_kind_t,
    #[doc = " The kind of propagation. Possible values: #dnnl_forward_training,"]
    #[doc = " #dnnl_forward_inference, #dnnl_backward, and #dnnl_backward_data."]
    pub prop_kind: dnnl_prop_kind_t,
    #[doc = " The kind of pooling algorithm."]
    #[doc = " Possible values: #dnnl_pooling_max,"]
    #[doc = " #dnnl_pooling_avg_include_padding, and"]
    #[doc = " #dnnl_pooling_avg_exclude_padding."]
    pub alg_kind: dnnl_alg_kind_t,
    #[doc = " Source memory descriptor."]
    pub src_desc: dnnl_memory_desc_t,
    #[doc = " Source gradient memory descriptor."]
    pub diff_src_desc: dnnl_memory_desc_t,
    #[doc = " Destination memory descriptor."]
    pub dst_desc: dnnl_memory_desc_t,
    #[doc = " Destination gradient memory descriptor."]
    pub diff_dst_desc: dnnl_memory_desc_t,
    #[doc = " Pooling kernel strides for spatial dimensions."]
    pub strides: dnnl_dims_t,
    #[doc = " Pooling kernel spatial dimensions."]
    pub kernel: dnnl_dims_t,
    #[doc = " Padding in each spatial dimension. padding[0] is a padding in the"]
    #[doc = " beginning (@p padding_l), padding[1] is a padding in the end (@p"]
    #[doc = " padding_r)."]
    pub padding: [dnnl_dims_t; 2usize],
    #[doc = " The accumulator data type. Initialized automatically."]
    pub accum_data_type: dnnl_data_type_t,
}
#[test]
fn bindgen_test_layout_dnnl_pooling_desc_t() {
    assert_eq!(
        ::std::mem::size_of::<dnnl_pooling_desc_t>(),
        3192usize,
        concat!("Size of: ", stringify!(dnnl_pooling_desc_t))
    );
    assert_eq!(
        ::std::mem::align_of::<dnnl_pooling_desc_t>(),
        8usize,
        concat!("Alignment of ", stringify!(dnnl_pooling_desc_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_pooling_desc_t>())).primitive_kind as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_pooling_desc_t),
            "::",
            stringify!(primitive_kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_pooling_desc_t>())).prop_kind as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_pooling_desc_t),
            "::",
            stringify!(prop_kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_pooling_desc_t>())).alg_kind as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_pooling_desc_t),
            "::",
            stringify!(alg_kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_pooling_desc_t>())).src_desc as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_pooling_desc_t),
            "::",
            stringify!(src_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_pooling_desc_t>())).diff_src_desc as *const _ as usize
        },
        712usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_pooling_desc_t),
            "::",
            stringify!(diff_src_desc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_pooling_desc_t>())).dst_desc as *const _ as usize },
        1408usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_pooling_desc_t),
            "::",
            stringify!(dst_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_pooling_desc_t>())).diff_dst_desc as *const _ as usize
        },
        2104usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_pooling_desc_t),
            "::",
            stringify!(diff_dst_desc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_pooling_desc_t>())).strides as *const _ as usize },
        2800usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_pooling_desc_t),
            "::",
            stringify!(strides)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_pooling_desc_t>())).kernel as *const _ as usize },
        2896usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_pooling_desc_t),
            "::",
            stringify!(kernel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_pooling_desc_t>())).padding as *const _ as usize },
        2992usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_pooling_desc_t),
            "::",
            stringify!(padding)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_pooling_desc_t>())).accum_data_type as *const _ as usize
        },
        3184usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_pooling_desc_t),
            "::",
            stringify!(accum_data_type)
        )
    );
}
#[doc = " A descriptor of a Local Response Normalization (LRN) operation."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct dnnl_lrn_desc_t {
    #[doc = " The kind of primitive. Used for self-identifying the primitive"]
    #[doc = " descriptor. Must be #dnnl_lrn."]
    pub primitive_kind: dnnl_primitive_kind_t,
    #[doc = " The kind of propagation. Possible values: #dnnl_forward_training,"]
    #[doc = " #dnnl_forward_inference, #dnnl_backward, and #dnnl_backward_data."]
    pub prop_kind: dnnl_prop_kind_t,
    #[doc = " LRN algorithm. Possible values: #dnnl_lrn_within_channel and"]
    #[doc = " #dnnl_lrn_across_channels."]
    pub alg_kind: dnnl_alg_kind_t,
    #[doc = " Source and destination memory descriptor."]
    pub data_desc: dnnl_memory_desc_t,
    #[doc = " Source and destination gradient memory descriptor."]
    pub diff_data_desc: dnnl_memory_desc_t,
    #[doc = " The number of channels to sum over (for cross-channel LRN) or the side"]
    #[doc = " length of the square region to sum over (for within-channel LRN)."]
    pub local_size: dnnl_dim_t,
    #[doc = " LRN alpha parameter."]
    pub lrn_alpha: f32,
    #[doc = " LRN beta parameter."]
    pub lrn_beta: f32,
    #[doc = " LRN k parameter."]
    pub lrn_k: f32,
}
#[test]
fn bindgen_test_layout_dnnl_lrn_desc_t() {
    assert_eq!(
        ::std::mem::size_of::<dnnl_lrn_desc_t>(),
        1432usize,
        concat!("Size of: ", stringify!(dnnl_lrn_desc_t))
    );
    assert_eq!(
        ::std::mem::align_of::<dnnl_lrn_desc_t>(),
        8usize,
        concat!("Alignment of ", stringify!(dnnl_lrn_desc_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_lrn_desc_t>())).primitive_kind as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_lrn_desc_t),
            "::",
            stringify!(primitive_kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_lrn_desc_t>())).prop_kind as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_lrn_desc_t),
            "::",
            stringify!(prop_kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_lrn_desc_t>())).alg_kind as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_lrn_desc_t),
            "::",
            stringify!(alg_kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_lrn_desc_t>())).data_desc as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_lrn_desc_t),
            "::",
            stringify!(data_desc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_lrn_desc_t>())).diff_data_desc as *const _ as usize },
        712usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_lrn_desc_t),
            "::",
            stringify!(diff_data_desc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_lrn_desc_t>())).local_size as *const _ as usize },
        1408usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_lrn_desc_t),
            "::",
            stringify!(local_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_lrn_desc_t>())).lrn_alpha as *const _ as usize },
        1416usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_lrn_desc_t),
            "::",
            stringify!(lrn_alpha)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_lrn_desc_t>())).lrn_beta as *const _ as usize },
        1420usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_lrn_desc_t),
            "::",
            stringify!(lrn_beta)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_lrn_desc_t>())).lrn_k as *const _ as usize },
        1424usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_lrn_desc_t),
            "::",
            stringify!(lrn_k)
        )
    );
}
#[doc = " A descriptor of a Batch Normalization operation."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct dnnl_batch_normalization_desc_t {
    #[doc = " The kind of primitive. Used for self-identifying the primitive"]
    #[doc = " descriptor. Must be #dnnl_batch_normalization."]
    pub primitive_kind: dnnl_primitive_kind_t,
    #[doc = " The kind of propagation. Possible values: #dnnl_forward_training,"]
    #[doc = " #dnnl_forward_inference, #dnnl_backward, and #dnnl_backward_data."]
    pub prop_kind: dnnl_prop_kind_t,
    #[doc = " Source and destination memory descriptor."]
    pub data_desc: dnnl_memory_desc_t,
    #[doc = " Source and destination gradient memory descriptor."]
    pub diff_data_desc: dnnl_memory_desc_t,
    #[doc = " Scale and shift data and gradient memory descriptors."]
    #[doc = ""]
    #[doc = " Scaleshift memory descriptor uses 2D #dnnl_nc format[2,Channels]. 1-st"]
    #[doc = " dimension contains gamma parameter, 2-nd dimension contains beta"]
    #[doc = " parameter."]
    pub data_scaleshift_desc: dnnl_memory_desc_t,
    pub diff_data_scaleshift_desc: dnnl_memory_desc_t,
    #[doc = " Statistics memory descriptor."]
    #[doc = ""]
    #[doc = " Statistics (mean or variance) descriptor use 1D #dnnl_x format[Channels]."]
    pub stat_desc: dnnl_memory_desc_t,
    #[doc = " Batch normalization epsilon parameter."]
    pub batch_norm_epsilon: f32,
    pub flags: ::libc::c_uint,
}
#[test]
fn bindgen_test_layout_dnnl_batch_normalization_desc_t() {
    assert_eq!(
        ::std::mem::size_of::<dnnl_batch_normalization_desc_t>(),
        3496usize,
        concat!("Size of: ", stringify!(dnnl_batch_normalization_desc_t))
    );
    assert_eq!(
        ::std::mem::align_of::<dnnl_batch_normalization_desc_t>(),
        8usize,
        concat!("Alignment of ", stringify!(dnnl_batch_normalization_desc_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_batch_normalization_desc_t>())).primitive_kind as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_batch_normalization_desc_t),
            "::",
            stringify!(primitive_kind)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_batch_normalization_desc_t>())).prop_kind as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_batch_normalization_desc_t),
            "::",
            stringify!(prop_kind)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_batch_normalization_desc_t>())).data_desc as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_batch_normalization_desc_t),
            "::",
            stringify!(data_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_batch_normalization_desc_t>())).diff_data_desc as *const _
                as usize
        },
        704usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_batch_normalization_desc_t),
            "::",
            stringify!(diff_data_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_batch_normalization_desc_t>())).data_scaleshift_desc
                as *const _ as usize
        },
        1400usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_batch_normalization_desc_t),
            "::",
            stringify!(data_scaleshift_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_batch_normalization_desc_t>())).diff_data_scaleshift_desc
                as *const _ as usize
        },
        2096usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_batch_normalization_desc_t),
            "::",
            stringify!(diff_data_scaleshift_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_batch_normalization_desc_t>())).stat_desc as *const _
                as usize
        },
        2792usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_batch_normalization_desc_t),
            "::",
            stringify!(stat_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_batch_normalization_desc_t>())).batch_norm_epsilon
                as *const _ as usize
        },
        3488usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_batch_normalization_desc_t),
            "::",
            stringify!(batch_norm_epsilon)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_batch_normalization_desc_t>())).flags as *const _ as usize
        },
        3492usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_batch_normalization_desc_t),
            "::",
            stringify!(flags)
        )
    );
}
#[doc = " A descriptor of a Layer Normalization operation."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct dnnl_layer_normalization_desc_t {
    #[doc = " The kind of primitive. Used for self-identifying the primitive"]
    #[doc = " descriptor. Must be #dnnl_layer_normalization."]
    pub primitive_kind: dnnl_primitive_kind_t,
    #[doc = " The kind of propagation. Possible values: #dnnl_forward_training,"]
    #[doc = " #dnnl_forward_inference, #dnnl_backward, and #dnnl_backward_data."]
    pub prop_kind: dnnl_prop_kind_t,
    #[doc = " Source and destination memory descriptor."]
    pub data_desc: dnnl_memory_desc_t,
    #[doc = " Source and destination gradient memory descriptor."]
    pub diff_data_desc: dnnl_memory_desc_t,
    #[doc = " Scale and shift data and gradient memory descriptors."]
    #[doc = ""]
    #[doc = " Scaleshift memory descriptor uses 2D #dnnl_ab"]
    #[doc = " format[2, normalized_dim] where 1-st dimension contains gamma parameter,"]
    #[doc = " 2-nd dimension contains beta parameter. Normalized_dim is equal to the"]
    #[doc = " last logical dimension of the data tensor across which normalization is"]
    #[doc = " performed."]
    pub data_scaleshift_desc: dnnl_memory_desc_t,
    pub diff_data_scaleshift_desc: dnnl_memory_desc_t,
    #[doc = " Mean and variance data memory descriptors."]
    #[doc = ""]
    #[doc = " Statistics (mean and variance) memory descriptor is the k-dimensional tensor"]
    #[doc = " where k is equal to data_tensor_ndims - 1 and may have any plain"]
    #[doc = " (stride[last_dim] == 1) user-provided format."]
    pub stat_desc: dnnl_memory_desc_t,
    #[doc = " Layer normalization epsilon parameter."]
    pub layer_norm_epsilon: f32,
    pub flags: ::libc::c_uint,
}
#[test]
fn bindgen_test_layout_dnnl_layer_normalization_desc_t() {
    assert_eq!(
        ::std::mem::size_of::<dnnl_layer_normalization_desc_t>(),
        3496usize,
        concat!("Size of: ", stringify!(dnnl_layer_normalization_desc_t))
    );
    assert_eq!(
        ::std::mem::align_of::<dnnl_layer_normalization_desc_t>(),
        8usize,
        concat!("Alignment of ", stringify!(dnnl_layer_normalization_desc_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_layer_normalization_desc_t>())).primitive_kind as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_layer_normalization_desc_t),
            "::",
            stringify!(primitive_kind)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_layer_normalization_desc_t>())).prop_kind as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_layer_normalization_desc_t),
            "::",
            stringify!(prop_kind)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_layer_normalization_desc_t>())).data_desc as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_layer_normalization_desc_t),
            "::",
            stringify!(data_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_layer_normalization_desc_t>())).diff_data_desc as *const _
                as usize
        },
        704usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_layer_normalization_desc_t),
            "::",
            stringify!(diff_data_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_layer_normalization_desc_t>())).data_scaleshift_desc
                as *const _ as usize
        },
        1400usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_layer_normalization_desc_t),
            "::",
            stringify!(data_scaleshift_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_layer_normalization_desc_t>())).diff_data_scaleshift_desc
                as *const _ as usize
        },
        2096usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_layer_normalization_desc_t),
            "::",
            stringify!(diff_data_scaleshift_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_layer_normalization_desc_t>())).stat_desc as *const _
                as usize
        },
        2792usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_layer_normalization_desc_t),
            "::",
            stringify!(stat_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_layer_normalization_desc_t>())).layer_norm_epsilon
                as *const _ as usize
        },
        3488usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_layer_normalization_desc_t),
            "::",
            stringify!(layer_norm_epsilon)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_layer_normalization_desc_t>())).flags as *const _ as usize
        },
        3492usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_layer_normalization_desc_t),
            "::",
            stringify!(flags)
        )
    );
}
#[doc = " A descriptor of an inner product operation."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct dnnl_inner_product_desc_t {
    #[doc = " The kind of primitive. Used for self-identifying the primitive"]
    #[doc = " descriptor. Must be #dnnl_inner_product."]
    pub primitive_kind: dnnl_primitive_kind_t,
    #[doc = " The kind of propagation. Possible values: #dnnl_forward_training,"]
    #[doc = " #dnnl_forward_inference, #dnnl_backward_data,"]
    #[doc = " #dnnl_backward_weights, and #dnnl_backward_bias."]
    pub prop_kind: dnnl_prop_kind_t,
    #[doc = " Source memory descriptor."]
    pub src_desc: dnnl_memory_desc_t,
    #[doc = " Source gradient memory descriptor."]
    pub diff_src_desc: dnnl_memory_desc_t,
    #[doc = " Weights memory descriptor."]
    pub weights_desc: dnnl_memory_desc_t,
    #[doc = " Weights gradient memory descriptor."]
    pub diff_weights_desc: dnnl_memory_desc_t,
    #[doc = " Bias memory descriptor."]
    pub bias_desc: dnnl_memory_desc_t,
    #[doc = " Bias gradient memory descriptor."]
    pub diff_bias_desc: dnnl_memory_desc_t,
    #[doc = " Destination memory descriptor."]
    pub dst_desc: dnnl_memory_desc_t,
    #[doc = " Destination gradient memory descriptor."]
    pub diff_dst_desc: dnnl_memory_desc_t,
    #[doc = " The accumulator data type. Initialized automatically."]
    pub accum_data_type: dnnl_data_type_t,
}
#[test]
fn bindgen_test_layout_dnnl_inner_product_desc_t() {
    assert_eq!(
        ::std::mem::size_of::<dnnl_inner_product_desc_t>(),
        5584usize,
        concat!("Size of: ", stringify!(dnnl_inner_product_desc_t))
    );
    assert_eq!(
        ::std::mem::align_of::<dnnl_inner_product_desc_t>(),
        8usize,
        concat!("Alignment of ", stringify!(dnnl_inner_product_desc_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_inner_product_desc_t>())).primitive_kind as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_inner_product_desc_t),
            "::",
            stringify!(primitive_kind)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_inner_product_desc_t>())).prop_kind as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_inner_product_desc_t),
            "::",
            stringify!(prop_kind)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_inner_product_desc_t>())).src_desc as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_inner_product_desc_t),
            "::",
            stringify!(src_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_inner_product_desc_t>())).diff_src_desc as *const _ as usize
        },
        704usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_inner_product_desc_t),
            "::",
            stringify!(diff_src_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_inner_product_desc_t>())).weights_desc as *const _ as usize
        },
        1400usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_inner_product_desc_t),
            "::",
            stringify!(weights_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_inner_product_desc_t>())).diff_weights_desc as *const _
                as usize
        },
        2096usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_inner_product_desc_t),
            "::",
            stringify!(diff_weights_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_inner_product_desc_t>())).bias_desc as *const _ as usize
        },
        2792usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_inner_product_desc_t),
            "::",
            stringify!(bias_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_inner_product_desc_t>())).diff_bias_desc as *const _
                as usize
        },
        3488usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_inner_product_desc_t),
            "::",
            stringify!(diff_bias_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_inner_product_desc_t>())).dst_desc as *const _ as usize
        },
        4184usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_inner_product_desc_t),
            "::",
            stringify!(dst_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_inner_product_desc_t>())).diff_dst_desc as *const _ as usize
        },
        4880usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_inner_product_desc_t),
            "::",
            stringify!(diff_dst_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_inner_product_desc_t>())).accum_data_type as *const _
                as usize
        },
        5576usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_inner_product_desc_t),
            "::",
            stringify!(accum_data_type)
        )
    );
}
#[repr(u32)]
#[non_exhaustive]
#[doc = " Flags for RNN cell."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum dnnl_rnn_flags_t {
    #[doc = " Undefined RNN flags"]
    dnnl_rnn_flags_undef = 0,
}
impl dnnl_rnn_direction_t {
    pub const dnnl_unidirectional: dnnl_rnn_direction_t =
        dnnl_rnn_direction_t::dnnl_unidirectional_left2right;
}
#[repr(u32)]
#[non_exhaustive]
#[doc = " A direction of RNN primitive execution."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum dnnl_rnn_direction_t {
    #[doc = " Unidirectional execution of RNN primitive from left to right."]
    dnnl_unidirectional_left2right = 0,
    #[doc = " Unidirectional execution of RNN primitive from right to left."]
    dnnl_unidirectional_right2left = 1,
    #[doc = " Bidirectional execution of RNN primitive with concatenation of the"]
    #[doc = " results."]
    dnnl_bidirectional_concat = 2,
    #[doc = " Bidirectional execution of RNN primitive with summation of the"]
    #[doc = " results."]
    dnnl_bidirectional_sum = 3,
}
#[doc = " A descriptor for an RNN operation."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct dnnl_rnn_desc_t {
    #[doc = " The kind of primitive. Used for self-identifying the primitive"]
    #[doc = " descriptor. Must be #dnnl_rnn."]
    pub primitive_kind: dnnl_primitive_kind_t,
    #[doc = " The kind of propagation. Possible values: #dnnl_forward_training,"]
    #[doc = " #dnnl_forward_inference, and #dnnl_backward."]
    pub prop_kind: dnnl_prop_kind_t,
    #[doc = " RNN cell kind. Must be one of #dnnl_vanilla_rnn,"]
    #[doc = " #dnnl_vanilla_lstm, #dnnl_vanilla_gru, or #dnnl_lbr_gru."]
    pub cell_kind: dnnl_alg_kind_t,
    #[doc = " The direction of RNN primitive execution."]
    pub direction: dnnl_rnn_direction_t,
    #[doc = " Source layer memory descriptor."]
    pub src_layer_desc: dnnl_memory_desc_t,
    #[doc = " Source iteration memory descriptor for hidden state."]
    pub src_iter_desc: dnnl_memory_desc_t,
    #[doc = " Source iteration memory descriptor for cell state."]
    pub src_iter_c_desc: dnnl_memory_desc_t,
    #[doc = " Weights layer memory descriptor."]
    pub weights_layer_desc: dnnl_memory_desc_t,
    #[doc = " Weights iteration memory descriptor."]
    pub weights_iter_desc: dnnl_memory_desc_t,
    #[doc = " Bias memory descriptor."]
    pub bias_desc: dnnl_memory_desc_t,
    #[doc = " Destination layer memory descriptor."]
    pub dst_layer_desc: dnnl_memory_desc_t,
    #[doc = " Destination iter memory descriptor for hidden state."]
    pub dst_iter_desc: dnnl_memory_desc_t,
    #[doc = " Destination iter memory descriptor for cell state."]
    pub dst_iter_c_desc: dnnl_memory_desc_t,
    #[doc = " Weights peephole memory descriptor."]
    #[doc = " This memory descriptor is equal to zero memory descriptor in case of"]
    #[doc = " non-peephole LSTMs and other non-LSTM RNNs."]
    pub weights_peephole_desc: dnnl_memory_desc_t,
    #[doc = " Weights projection memory descriptor."]
    #[doc = " This memory descriptor is equal to zero memory descriptor in case of"]
    #[doc = " non-projection LSTMs and other non-LSTM RNNs."]
    pub weights_projection_desc: dnnl_memory_desc_t,
    #[doc = " Source gradient layer memory descriptor."]
    pub diff_src_layer_desc: dnnl_memory_desc_t,
    #[doc = " Source gradient iter memory descriptor for hidden state."]
    pub diff_src_iter_desc: dnnl_memory_desc_t,
    #[doc = " Source gradient iter memory descriptor for cell state."]
    pub diff_src_iter_c_desc: dnnl_memory_desc_t,
    #[doc = " Weights gradient layer memory descriptor."]
    pub diff_weights_layer_desc: dnnl_memory_desc_t,
    #[doc = " Weights gradient iter memory descriptor."]
    pub diff_weights_iter_desc: dnnl_memory_desc_t,
    #[doc = " Bias gradient memory descriptor."]
    pub diff_bias_desc: dnnl_memory_desc_t,
    #[doc = " Destination gradient layer memory descriptor."]
    pub diff_dst_layer_desc: dnnl_memory_desc_t,
    #[doc = " Destination gradient iteration memory descriptor for hidden state."]
    pub diff_dst_iter_desc: dnnl_memory_desc_t,
    #[doc = " Destination gradient iteration memory descriptor for cell state."]
    pub diff_dst_iter_c_desc: dnnl_memory_desc_t,
    #[doc = " Weights gradient peephole memory descriptor."]
    #[doc = " This memory descriptor is equal to zero memory descriptor in case of"]
    #[doc = " non-peephole LSTMs and other non-LSTM RNNs."]
    pub diff_weights_peephole_desc: dnnl_memory_desc_t,
    #[doc = " Weights gradient projection memory descriptor."]
    #[doc = " This memory descriptor is equal to zero memory descriptor in case of"]
    #[doc = " non-projection LSTMs and other non-LSTM RNNs."]
    pub diff_weights_projection_desc: dnnl_memory_desc_t,
    #[doc = " RNN cell flags"]
    pub flags: ::libc::c_uint,
    #[doc = " Activation function used for vanilla_rnn cell kind."]
    #[doc = " Must be either #dnnl_eltwise_relu or #dnnl_eltwise_tanh."]
    pub activation_kind: dnnl_alg_kind_t,
    pub alpha: f32,
    pub beta: f32,
}
#[test]
fn bindgen_test_layout_dnnl_rnn_desc_t() {
    assert_eq!(
        ::std::mem::size_of::<dnnl_rnn_desc_t>(),
        15344usize,
        concat!("Size of: ", stringify!(dnnl_rnn_desc_t))
    );
    assert_eq!(
        ::std::mem::align_of::<dnnl_rnn_desc_t>(),
        8usize,
        concat!("Alignment of ", stringify!(dnnl_rnn_desc_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_rnn_desc_t>())).primitive_kind as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_desc_t),
            "::",
            stringify!(primitive_kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_rnn_desc_t>())).prop_kind as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_desc_t),
            "::",
            stringify!(prop_kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_rnn_desc_t>())).cell_kind as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_desc_t),
            "::",
            stringify!(cell_kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_rnn_desc_t>())).direction as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_desc_t),
            "::",
            stringify!(direction)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_rnn_desc_t>())).src_layer_desc as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_desc_t),
            "::",
            stringify!(src_layer_desc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_rnn_desc_t>())).src_iter_desc as *const _ as usize },
        712usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_desc_t),
            "::",
            stringify!(src_iter_desc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_rnn_desc_t>())).src_iter_c_desc as *const _ as usize },
        1408usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_desc_t),
            "::",
            stringify!(src_iter_c_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_rnn_desc_t>())).weights_layer_desc as *const _ as usize
        },
        2104usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_desc_t),
            "::",
            stringify!(weights_layer_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_rnn_desc_t>())).weights_iter_desc as *const _ as usize
        },
        2800usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_desc_t),
            "::",
            stringify!(weights_iter_desc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_rnn_desc_t>())).bias_desc as *const _ as usize },
        3496usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_desc_t),
            "::",
            stringify!(bias_desc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_rnn_desc_t>())).dst_layer_desc as *const _ as usize },
        4192usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_desc_t),
            "::",
            stringify!(dst_layer_desc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_rnn_desc_t>())).dst_iter_desc as *const _ as usize },
        4888usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_desc_t),
            "::",
            stringify!(dst_iter_desc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_rnn_desc_t>())).dst_iter_c_desc as *const _ as usize },
        5584usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_desc_t),
            "::",
            stringify!(dst_iter_c_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_rnn_desc_t>())).weights_peephole_desc as *const _ as usize
        },
        6280usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_desc_t),
            "::",
            stringify!(weights_peephole_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_rnn_desc_t>())).weights_projection_desc as *const _ as usize
        },
        6976usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_desc_t),
            "::",
            stringify!(weights_projection_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_rnn_desc_t>())).diff_src_layer_desc as *const _ as usize
        },
        7672usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_desc_t),
            "::",
            stringify!(diff_src_layer_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_rnn_desc_t>())).diff_src_iter_desc as *const _ as usize
        },
        8368usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_desc_t),
            "::",
            stringify!(diff_src_iter_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_rnn_desc_t>())).diff_src_iter_c_desc as *const _ as usize
        },
        9064usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_desc_t),
            "::",
            stringify!(diff_src_iter_c_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_rnn_desc_t>())).diff_weights_layer_desc as *const _ as usize
        },
        9760usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_desc_t),
            "::",
            stringify!(diff_weights_layer_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_rnn_desc_t>())).diff_weights_iter_desc as *const _ as usize
        },
        10456usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_desc_t),
            "::",
            stringify!(diff_weights_iter_desc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_rnn_desc_t>())).diff_bias_desc as *const _ as usize },
        11152usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_desc_t),
            "::",
            stringify!(diff_bias_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_rnn_desc_t>())).diff_dst_layer_desc as *const _ as usize
        },
        11848usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_desc_t),
            "::",
            stringify!(diff_dst_layer_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_rnn_desc_t>())).diff_dst_iter_desc as *const _ as usize
        },
        12544usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_desc_t),
            "::",
            stringify!(diff_dst_iter_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_rnn_desc_t>())).diff_dst_iter_c_desc as *const _ as usize
        },
        13240usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_desc_t),
            "::",
            stringify!(diff_dst_iter_c_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_rnn_desc_t>())).diff_weights_peephole_desc as *const _
                as usize
        },
        13936usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_desc_t),
            "::",
            stringify!(diff_weights_peephole_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_rnn_desc_t>())).diff_weights_projection_desc as *const _
                as usize
        },
        14632usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_desc_t),
            "::",
            stringify!(diff_weights_projection_desc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_rnn_desc_t>())).flags as *const _ as usize },
        15328usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_desc_t),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_rnn_desc_t>())).activation_kind as *const _ as usize },
        15332usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_desc_t),
            "::",
            stringify!(activation_kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_rnn_desc_t>())).alpha as *const _ as usize },
        15336usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_desc_t),
            "::",
            stringify!(alpha)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_rnn_desc_t>())).beta as *const _ as usize },
        15340usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_rnn_desc_t),
            "::",
            stringify!(beta)
        )
    );
}
#[doc = " A descriptor of a binary operation."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct dnnl_binary_desc_t {
    #[doc = " The kind of primitive. Used for self-identifying the primitive"]
    #[doc = " descriptor. Must be #dnnl_binary."]
    pub primitive_kind: dnnl_primitive_kind_t,
    #[doc = " The kind of the binary algorithm. Possible values:"]
    #[doc = " #dnnl_binary_add, #dnnl_binary_mul, #dnnl_binary_max and"]
    #[doc = " #dnnl_binary_min."]
    pub alg_kind: dnnl_alg_kind_t,
    #[doc = " Source memory descriptors."]
    pub src_desc: [dnnl_memory_desc_t; 2usize],
    #[doc = " Destination memory descriptor."]
    pub dst_desc: dnnl_memory_desc_t,
}
#[test]
fn bindgen_test_layout_dnnl_binary_desc_t() {
    assert_eq!(
        ::std::mem::size_of::<dnnl_binary_desc_t>(),
        2096usize,
        concat!("Size of: ", stringify!(dnnl_binary_desc_t))
    );
    assert_eq!(
        ::std::mem::align_of::<dnnl_binary_desc_t>(),
        8usize,
        concat!("Alignment of ", stringify!(dnnl_binary_desc_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_binary_desc_t>())).primitive_kind as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_binary_desc_t),
            "::",
            stringify!(primitive_kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_binary_desc_t>())).alg_kind as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_binary_desc_t),
            "::",
            stringify!(alg_kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_binary_desc_t>())).src_desc as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_binary_desc_t),
            "::",
            stringify!(src_desc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_binary_desc_t>())).dst_desc as *const _ as usize },
        1400usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_binary_desc_t),
            "::",
            stringify!(dst_desc)
        )
    );
}
#[doc = " A descriptor of a matrix multiplication operation."]
#[doc = ""]
#[doc = " 2D case:"]
#[doc = "     dst[m, n] = src[m, k] * weights[k, n] + bias[m, n]"]
#[doc = ""]
#[doc = " 3D case:"]
#[doc = "     dst[mb, m, n] = src[mb, m, k] * weights[mb, k, n] + bias[mb, m, n]"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct dnnl_matmul_desc_t {
    #[doc = " The kind of primitive. Used for self-identifying the primitive"]
    #[doc = " descriptor. Must be #dnnl_matmul."]
    pub primitive_kind: dnnl_primitive_kind_t,
    #[doc = " Source memory descriptor."]
    pub src_desc: dnnl_memory_desc_t,
    #[doc = " Weights memory descriptor."]
    pub weights_desc: dnnl_memory_desc_t,
    #[doc = " Bias memory descriptor."]
    pub bias_desc: dnnl_memory_desc_t,
    #[doc = " Destination memory descriptor."]
    pub dst_desc: dnnl_memory_desc_t,
    #[doc = " The accumulator data type. Initialized automatically."]
    pub accum_data_type: dnnl_data_type_t,
}
#[test]
fn bindgen_test_layout_dnnl_matmul_desc_t() {
    assert_eq!(
        ::std::mem::size_of::<dnnl_matmul_desc_t>(),
        2800usize,
        concat!("Size of: ", stringify!(dnnl_matmul_desc_t))
    );
    assert_eq!(
        ::std::mem::align_of::<dnnl_matmul_desc_t>(),
        8usize,
        concat!("Alignment of ", stringify!(dnnl_matmul_desc_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_matmul_desc_t>())).primitive_kind as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_matmul_desc_t),
            "::",
            stringify!(primitive_kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_matmul_desc_t>())).src_desc as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_matmul_desc_t),
            "::",
            stringify!(src_desc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_matmul_desc_t>())).weights_desc as *const _ as usize },
        704usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_matmul_desc_t),
            "::",
            stringify!(weights_desc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_matmul_desc_t>())).bias_desc as *const _ as usize },
        1400usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_matmul_desc_t),
            "::",
            stringify!(bias_desc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_matmul_desc_t>())).dst_desc as *const _ as usize },
        2096usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_matmul_desc_t),
            "::",
            stringify!(dst_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_matmul_desc_t>())).accum_data_type as *const _ as usize
        },
        2792usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_matmul_desc_t),
            "::",
            stringify!(accum_data_type)
        )
    );
}
#[doc = " A descriptor of resampling operation."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct dnnl_resampling_desc_t {
    #[doc = " The kind of primitive. Used for self-identifying the primitive"]
    #[doc = " descriptor. Must be #dnnl_resampling."]
    pub primitive_kind: dnnl_primitive_kind_t,
    #[doc = " The kind of propagation. Possible values: #dnnl_forward_training,"]
    #[doc = " #dnnl_forward_inference, #dnnl_backward_data,"]
    pub prop_kind: dnnl_prop_kind_t,
    #[doc = " The kind of the resampling algorithm. Possible values:"]
    #[doc = " #dnnl_resampling_nearest, #dnnl_resampling_linear."]
    pub alg_kind: dnnl_alg_kind_t,
    #[doc = " Source memory descriptor."]
    pub src_desc: dnnl_memory_desc_t,
    #[doc = " Source gradient memory descriptor."]
    pub diff_src_desc: dnnl_memory_desc_t,
    #[doc = " Destination memory descriptor."]
    pub dst_desc: dnnl_memory_desc_t,
    #[doc = " Destination gradient memory descriptor."]
    pub diff_dst_desc: dnnl_memory_desc_t,
    #[doc = " Resampling factor in each spatial dimension."]
    pub factors: [f32; 12usize],
}
#[test]
fn bindgen_test_layout_dnnl_resampling_desc_t() {
    assert_eq!(
        ::std::mem::size_of::<dnnl_resampling_desc_t>(),
        2848usize,
        concat!("Size of: ", stringify!(dnnl_resampling_desc_t))
    );
    assert_eq!(
        ::std::mem::align_of::<dnnl_resampling_desc_t>(),
        8usize,
        concat!("Alignment of ", stringify!(dnnl_resampling_desc_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_resampling_desc_t>())).primitive_kind as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_resampling_desc_t),
            "::",
            stringify!(primitive_kind)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_resampling_desc_t>())).prop_kind as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_resampling_desc_t),
            "::",
            stringify!(prop_kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_resampling_desc_t>())).alg_kind as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_resampling_desc_t),
            "::",
            stringify!(alg_kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_resampling_desc_t>())).src_desc as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_resampling_desc_t),
            "::",
            stringify!(src_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_resampling_desc_t>())).diff_src_desc as *const _ as usize
        },
        712usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_resampling_desc_t),
            "::",
            stringify!(diff_src_desc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_resampling_desc_t>())).dst_desc as *const _ as usize },
        1408usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_resampling_desc_t),
            "::",
            stringify!(dst_desc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dnnl_resampling_desc_t>())).diff_dst_desc as *const _ as usize
        },
        2104usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_resampling_desc_t),
            "::",
            stringify!(diff_dst_desc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_resampling_desc_t>())).factors as *const _ as usize },
        2800usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_resampling_desc_t),
            "::",
            stringify!(factors)
        )
    );
}
#[repr(u32)]
#[non_exhaustive]
#[doc = " @brief Kinds of engines."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum dnnl_engine_kind_t {
    #[doc = " An unspecified engine."]
    dnnl_any_engine = 0,
    #[doc = " CPU engine."]
    dnnl_cpu = 1,
    #[doc = " GPU engine."]
    dnnl_gpu = 2,
}
#[doc = " @struct dnnl_engine"]
#[doc = " @brief An opaque structure to describe an engine."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dnnl_engine {
    _unused: [u8; 0],
}
#[doc = " @brief An engine handle."]
pub type dnnl_engine_t = *mut dnnl_engine;
#[doc = " @struct dnnl_primitive_desc_iterator"]
#[doc = " @brief An opaque structure to describe a primitive descriptor iterator."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dnnl_primitive_desc_iterator {
    _unused: [u8; 0],
}
#[doc = " @brief A primitive descriptor iterator handle."]
pub type dnnl_primitive_desc_iterator_t = *mut dnnl_primitive_desc_iterator;
#[doc = " @brief A constant primitive descriptor iterator handle."]
pub type const_dnnl_primitive_desc_iterator_t = *const dnnl_primitive_desc_iterator;
#[doc = " @struct dnnl_primitive_desc"]
#[doc = " @brief An opaque structure to describe a primitive descriptor."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dnnl_primitive_desc {
    _unused: [u8; 0],
}
#[doc = " @brief A primitive descriptor handle."]
pub type dnnl_primitive_desc_t = *mut dnnl_primitive_desc;
#[doc = " @brief A constant primitive descriptor handle."]
pub type const_dnnl_primitive_desc_t = *const dnnl_primitive_desc;
#[repr(u32)]
#[non_exhaustive]
#[doc = " Scratchpad mode"]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum dnnl_scratchpad_mode_t {
    #[doc = " The library manages the scratchpad allocation according to the policy"]
    #[doc = " specified by the `DNNL_ENABLE_CONCURRENT_EXEC`"]
    #[doc = " [build option](@ref dev_guide_build_options) (default)."]
    #[doc = ""]
    #[doc = " When `DNNL_ENABLE_CONCURRENT_EXEC=OFF` (default), the library"]
    #[doc = " scratchpad is common to all primitives to reduce the memory footprint."]
    #[doc = " This configuration comes with limited thread-safety properties, namely"]
    #[doc = " primitives can be created and executed in parallel but cannot migrate"]
    #[doc = " between threads (in other words, each primitive should be executed in"]
    #[doc = " the same thread it was created in)."]
    #[doc = ""]
    #[doc = " When `DNNL_ENABLE_CONCURRENT_EXEC=ON`, the library scratchpad is"]
    #[doc = " private to each primitive. The memory footprint is larger than when"]
    #[doc = " using `DNNL_ENABLE_CONCURRENT_EXEC=OFF` but different primitives can be"]
    #[doc = " created and run concurrently (the same primitive cannot be run"]
    #[doc = " concurrently from two different threads though)."]
    dnnl_scratchpad_mode_library = 0,
    #[doc = " The user manages the scratchpad allocation by querying and providing"]
    #[doc = " the scratchpad memory to primitives. This mode is thread-safe as long"]
    #[doc = " as the scratchpad buffers are not used concurrently by two primitive"]
    #[doc = " executions."]
    dnnl_scratchpad_mode_user = 1,
}
#[doc = " @struct dnnl_primitive_attr"]
#[doc = " @brief An opaque structure for primitive descriptor attributes."]
#[doc = ""]
#[doc = " Attributes may contain:"]
#[doc = "  - output scales (to scale the result prior to storing it to the memory)"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dnnl_primitive_attr {
    _unused: [u8; 0],
}
#[doc = " @brief A primitive descriptor attributes handle that controls primitive"]
#[doc = " behavior."]
pub type dnnl_primitive_attr_t = *mut dnnl_primitive_attr;
#[doc = " @brief A constant primitive descriptor attributes handle."]
pub type const_dnnl_primitive_attr_t = *const dnnl_primitive_attr;
#[doc = " @struct dnnl_post_ops"]
#[doc = " @brief An opaque structure for a chain of post operations."]
#[doc = ""]
#[doc = " dnnl_post_ops can be used to perform some (trivial) operations like"]
#[doc = " accumulation or eltwise after certain primitives like convolution."]
#[doc = ""]
#[doc = " Post operations might be combined together, making a chain of post"]
#[doc = " operations. For instance one can configure convolution followed by"]
#[doc = " accumulation followed by eltwise. This might be especially beneficial"]
#[doc = " for residual learning blocks."]
#[doc = ""]
#[doc = " @warning"]
#[doc = "      Of course not all combinations are supported, so the user should handle"]
#[doc = "      errors accordingly."]
#[doc = ""]
#[doc = " Supported post operations:"]
#[doc = "  - accumulation (base primitive: convolution)"]
#[doc = "  - eltwise (base primitive: convolution)"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dnnl_post_ops {
    _unused: [u8; 0],
}
#[doc = " @brief A post operation chain handle."]
pub type dnnl_post_ops_t = *mut dnnl_post_ops;
#[doc = " @brief A constant post operation chain handle."]
pub type const_dnnl_post_ops_t = *const dnnl_post_ops;
#[doc = " @struct dnnl_primitive"]
#[doc = " An opaque structure to describe a primitive."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dnnl_primitive {
    _unused: [u8; 0],
}
#[doc = " A primitive handle."]
pub type dnnl_primitive_t = *mut dnnl_primitive;
#[doc = " A constant primitive handle."]
pub type const_dnnl_primitive_t = *const dnnl_primitive;
#[doc = " A structure that contains an index and a memory object, and is used to pass"]
#[doc = " arguments to dnnl_primitive_execute()."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dnnl_exec_arg_t {
    #[doc = "< An argument index, e.g. DNNL_ARG_SRC"]
    pub arg: ::libc::c_int,
    #[doc = "< Input/output memory"]
    pub memory: dnnl_memory_t,
}
#[test]
fn bindgen_test_layout_dnnl_exec_arg_t() {
    assert_eq!(
        ::std::mem::size_of::<dnnl_exec_arg_t>(),
        16usize,
        concat!("Size of: ", stringify!(dnnl_exec_arg_t))
    );
    assert_eq!(
        ::std::mem::align_of::<dnnl_exec_arg_t>(),
        8usize,
        concat!("Alignment of ", stringify!(dnnl_exec_arg_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_exec_arg_t>())).arg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_exec_arg_t),
            "::",
            stringify!(arg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_exec_arg_t>())).memory as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_exec_arg_t),
            "::",
            stringify!(memory)
        )
    );
}
#[repr(u32)]
#[non_exhaustive]
#[doc = " Primitive descriptor query specification"]
#[doc = ""]
#[doc = " For generic function dnnl_primitive_desc_query(), the type of result must"]
#[doc = " agree with the queried argument. The correspondence table:"]
#[doc = ""]
#[doc = " Query kind                      | Type of query result"]
#[doc = " --------------------------------|-----------------------------"]
#[doc = " #dnnl_query_engine              | #dnnl_engine_t *"]
#[doc = " #dnnl_query_scratchpad_engine   | #dnnl_engine_t *"]
#[doc = " #dnnl_query_primitive_kind      | #dnnl_primitive_kind_t *"]
#[doc = " dnnl_query_*_s32                | int *"]
#[doc = " dnnl_query_*_s64                | #dnnl_dim_t * (same as int64_t *)"]
#[doc = " dnnl_query_*_f64                | double *"]
#[doc = " dnnl_query_*_str                | const char **"]
#[doc = " #dnnl_query_op_d                | #const_dnnl_op_desc_t *"]
#[doc = " dnnl_query_*_md                 | const #dnnl_memory_desc_t **"]
#[doc = " dnnl_query_*_\\<op\\>_d           | const dnnl_\\<op\\>_desc_t **"]
#[doc = " dnnl_query_*_pd                 | #const_dnnl_primitive_desc_t *"]
#[doc = ""]
#[doc = " @note"]
#[doc = "     Rule of thumb: all opaque types and structures are returned by"]
#[doc = "     reference. All numbers are returned by value."]
#[doc = ""]
#[doc = " @warning"]
#[doc = "     All returned references point to constant objects and are valid only"]
#[doc = "     during the lifetime of the queried primitive descriptor. Returned objects"]
#[doc = "     must not be destroyed by the user. If you need to keep the object longer"]
#[doc = "     than the lifetime of the queried primitive descriptor, use"]
#[doc = "     dnnl_primitive_desc_clone() to make a copy."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum dnnl_query_t {
    #[doc = "< no query"]
    dnnl_query_undef = 0,
    #[doc = "< execution engine"]
    dnnl_query_engine = 1,
    #[doc = "< primitive kind"]
    dnnl_query_primitive_kind = 2,
    #[doc = "< number of inputs expected"]
    dnnl_query_num_of_inputs_s32 = 3,
    #[doc = "< number of outputs expected"]
    dnnl_query_num_of_outputs_s32 = 4,
    #[doc = "< runtime estimation (seconds)"]
    dnnl_query_time_estimate_f64 = 5,
    #[doc = "< memory consumption -- extra"]
    dnnl_query_memory_consumption_s64 = 6,
    #[doc = "< scratchpad engine -- engine to be used"]
    dnnl_query_scratchpad_engine = 7,
    #[doc = "< implementation name"]
    dnnl_query_impl_info_str = 8,
    #[doc = "< source engine"]
    dnnl_query_reorder_src_engine = 9,
    #[doc = "< destination engine"]
    dnnl_query_reorder_dst_engine = 10,
    #[doc = "< propagation kind"]
    dnnl_query_prop_kind = 11,
    #[doc = "< stub"]
    dnnl_query_some_d = 64,
    #[doc = "< op descriptor"]
    dnnl_query_op_d = 65,
    #[doc = "< convolution descriptor"]
    dnnl_query_convolution_d = 66,
    #[doc = "< deconvolution descriptor"]
    dnnl_query_deconvolution_d = 67,
    #[doc = "< shuffle descriptor"]
    dnnl_query_shuffle_d = 68,
    #[doc = "< eltwise descriptor"]
    dnnl_query_eltwise_d = 69,
    #[doc = "< softmax descriptor"]
    dnnl_query_softmax_d = 70,
    #[doc = "< pooling descriptor"]
    dnnl_query_pooling_d = 71,
    #[doc = "< lrn descriptor"]
    dnnl_query_lrn_d = 72,
    #[doc = "< batch normalization descriptor"]
    dnnl_query_batch_normalization_d = 73,
    #[doc = "< layer normalization descriptor"]
    dnnl_query_layer_normalization_d = 74,
    #[doc = "< inner product descriptor"]
    dnnl_query_inner_product_d = 75,
    #[doc = "< rnn descriptor"]
    dnnl_query_rnn_d = 76,
    #[doc = "< GEMM descriptor (internal)"]
    dnnl_query_gemm_d = 77,
    #[doc = "< binary descriptor"]
    dnnl_query_binary_d = 78,
    #[doc = "< logsoftmax descriptor"]
    dnnl_query_logsoftmax_d = 79,
    #[doc = "< matrix multiplication (matmul) descriptor"]
    dnnl_query_matmul_d = 80,
    #[doc = "< resampling descriptor"]
    dnnl_query_resampling_d = 81,
    #[doc = "< stub"]
    dnnl_query_some_md = 128,
    #[doc = "< source memory desc"]
    dnnl_query_src_md = 129,
    #[doc = "< source gradient memory desc"]
    dnnl_query_diff_src_md = 130,
    #[doc = "< weights memory descriptor desc"]
    dnnl_query_weights_md = 131,
    #[doc = "< weights grad. memory desc"]
    dnnl_query_diff_weights_md = 132,
    #[doc = "< destination memory desc"]
    dnnl_query_dst_md = 133,
    #[doc = "< destination grad. memory desc"]
    dnnl_query_diff_dst_md = 134,
    #[doc = "< workspace memory desc"]
    dnnl_query_workspace_md = 135,
    #[doc = "< scratchpad memory desc"]
    dnnl_query_scratchpad_md = 136,
    #[doc = "< memory desc of an execute argument"]
    dnnl_query_exec_arg_md = 255,
}
impl dnnl_stream_flags_t {
    pub const dnnl_stream_default_flags: dnnl_stream_flags_t =
        dnnl_stream_flags_t::dnnl_stream_default_order;
}
#[repr(u32)]
#[non_exhaustive]
#[doc = " @brief Stream flags."]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum dnnl_stream_flags_t {
    #[doc = " Default order execution. Either in-order or out-of-order depending on"]
    #[doc = " the runtime."]
    dnnl_stream_default_order = 1,
    #[doc = " In-order execution."]
    dnnl_stream_in_order = 2,
    #[doc = " Out-of-order execution."]
    dnnl_stream_out_of_order = 4,
}
#[doc = " @struct dnnl_stream"]
#[doc = " An opaque structure to describe an execution stream."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dnnl_stream {
    _unused: [u8; 0],
}
#[doc = " An execution stream handle."]
pub type dnnl_stream_t = *mut dnnl_stream;
#[doc = " A constant execution stream handle."]
pub type const_dnnl_stream_t = *const dnnl_stream;
#[doc = " An opaque structure to describe execution stream attrbutes."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dnnl_stream_attr {
    _unused: [u8; 0],
}
#[doc = " An execution stream attributes handle."]
pub type dnnl_stream_attr_t = *mut dnnl_stream_attr;
#[doc = " A constant execution stream attributes handle."]
pub type const_dnnl_stream_attr_t = *const dnnl_stream_attr;
#[doc = " Structure containing version information as per [Semantic"]
#[doc = " Versioning](https://semver.org)"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dnnl_version_t {
    #[doc = "< Major version"]
    pub major: ::libc::c_int,
    #[doc = "< Minor version"]
    pub minor: ::libc::c_int,
    #[doc = "< Patch version"]
    pub patch: ::libc::c_int,
    #[doc = "< Git hash of the sources (may be absent)"]
    pub hash: *const ::libc::c_char,
    #[doc = "< CPU runtime"]
    pub cpu_runtime: ::libc::c_uint,
    #[doc = "< GPU runtime"]
    pub gpu_runtime: ::libc::c_uint,
}
#[test]
fn bindgen_test_layout_dnnl_version_t() {
    assert_eq!(
        ::std::mem::size_of::<dnnl_version_t>(),
        32usize,
        concat!("Size of: ", stringify!(dnnl_version_t))
    );
    assert_eq!(
        ::std::mem::align_of::<dnnl_version_t>(),
        8usize,
        concat!("Alignment of ", stringify!(dnnl_version_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_version_t>())).major as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_version_t),
            "::",
            stringify!(major)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_version_t>())).minor as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_version_t),
            "::",
            stringify!(minor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_version_t>())).patch as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_version_t),
            "::",
            stringify!(patch)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_version_t>())).hash as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_version_t),
            "::",
            stringify!(hash)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_version_t>())).cpu_runtime as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_version_t),
            "::",
            stringify!(cpu_runtime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dnnl_version_t>())).gpu_runtime as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(dnnl_version_t),
            "::",
            stringify!(gpu_runtime)
        )
    );
}
#[repr(u32)]
#[non_exhaustive]
#[doc = " CPU instruction set flags"]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum dnnl_cpu_isa_t {
    #[doc = " Any ISA (no restrictions)"]
    dnnl_cpu_isa_all = 0,
    #[doc = " Intel Streaming SIMD Extensions 4.1 (Intel SSE4.1)"]
    dnnl_cpu_isa_sse41 = 1,
    #[doc = " Intel Advanced Vector Extensions (Intel AVX)"]
    dnnl_cpu_isa_avx = 3,
    #[doc = " Intel Advanced Vector Extensions 2 (Intel AVX2)"]
    dnnl_cpu_isa_avx2 = 7,
    #[doc = " Intel Advanced Vector Extensions 512 (Intel AVX-512) subset"]
    #[doc = " for Intel Xeon Phi processors x200 Series."]
    dnnl_cpu_isa_avx512_mic = 15,
    #[doc = " Intel AVX-512 subset"]
    #[doc = " for Intel Xeon Phi processors 7235, 7285, 7295 Series."]
    dnnl_cpu_isa_avx512_mic_4ops = 31,
